[
  {
    "Region": "Africa",
    "Events": [
      {
        "country": "Niger",
        "description": "Relations with Benin warmed, while govt continued diplomatic realignment; jihadist insecurity persisted in south.",
        "detailedDescription": "Beninese-Nigerien ties slowly improved. Despite positive bilateral visits in July, President Gen. Tiani 3 Aug reiterated claims Beninese govt was hosting French subversive elements working to destabilise govt, said restoring relations would depend on assurances Benin posed no security threat. Steady de-escalation, however, continued despite rhetoric, with Nigerien authorities 6 Aug accepting credentials presented by new Beninese ambassador. In another sign of warming ties, Benin 16 Aug authorised resumption of trade transporting Nigerien crude oil through its Sm port; land border, however, remained closed. Diplomatic realignment continued. Govt 6 Aug cut diplomatic ties with Ukraine over its supposed support to armed groups involved in fighting in Mali (see Mali); military authorities said move was in solidarity with Bamako, who cut ties with Kyiv two days prior. Ukraine 8 Aug said decision was regrettable and accusations groundless and untrue. Burkina Faso, Mali and Niger  who make up regional body Alliance of Sahel States  19 Aug sent joint letter to UN Security Council condemning Ukraines open and assumed support for international terrorism and calling on body to take appropriate measures. In sign of rapprochement after months of heightened tensions, defence chief 28 Aug hosted Nigerian counterpart in capital Niamey. Meanwhile, U.S. military 5 Aug completed withdrawal from Agadez drone base, month earlier than Sept deadline, while last German troops 30 Aug left country; Washington left door open to future non-military cooperation, but withdrawals and tensions with Kyiv highlighted Niameys shift away from Western partners and toward Moscow. Jihadist violence persisted in Diffa and Tillabery regions. In Tillabery (south west), al-Qaeda-affiliated Group for the Support of Islam and Muslims 2 Aug claimed to have taken hostage two Russian citizens working for Russian company in Mbanga area  rich with gold mines  at unspecified date; militants likely from the Islamic State Sahel Province 13 Aug attacked several villages in Ayorou district, leaving 23 civilians dead. In Diffa (south east), suspected Islamic State West Africa Province fighters 14 Aug attacked military escort on road between Main-Soroa and Diffa town, killing four civilians and wounding several soldiers and civilians. West Africa",
        "severityScore": 95,
        "mediaScore": 93,
        "normalizedDifference": 0.021052631578947368
      },
      {
        "country": "Ethiopia",
        "description": "Leadership of Tigray Peoples Liberation Front (TPLF) fractured, violence in Amhara and Oromia regions remained rampant, and relations with Mogadishu and Cairo grew more strained.",
        "detailedDescription": "TPLF leadership splintered. National Election Board of Ethiopia 9 Aug registered TPLF as new party under special conditions, saying it must conduct general assembly within six months and choose new leadership to finalise registration. Ruling fractured TPLF, with faction led by party chairman Debretsion Gebremichael 11 Aug rejecting decision and insisting on restoration of partys former legal status; faction led by Tigray Interim Administration President Getachew Reda, meanwhile, advocated closer ties with federal govt. Debretsions faction 13-19 Aug held party congress despite national election board warning it did not comply with bodys ruling; congress ended with election of new leadership that excludes Reda and his allies (who boycotted conference and held their own meeting), marking major shift within partys power structure. Tigray military leaders 8 Aug warned they will not tolerate anything that undermines peace. Amhara region remained wracked by govt-insurgent fighting. Clashes between security forces and Fano militants occurred in West Gojjam, East Gojjam, North Wello, North Shewa, Central Gondar, North Gondar and South Gondar zones as hopes for peace talks faltered amid tensions among Fano groups. Meanwhile, UN 14 Aug reported unidentified armed group killed humanitarian worker in North Wello. Conflict persisted in Oromia amid tensions within Oromo Liberation Army (OLA). Federal-OLA clashes persisted in regions West Guji, North, South West and East Shewa, and West, Kellem and Horo Guduru Wollega zones, with civilians frequently targeted. Govt made little effort to resume talks despite insecurity, while tensions within OLA worsened; notably, OLA leader Jaal Marroo Dirribaa 14 Aug accused elements within insurgency of collaborating with govt. Tensions with Somalia and Egypt intensified over defence pact. In context of heightened tensions between Mogadishu and Addis Ababa over latters port deal with Somaliland, presidents of Egypt and Somalia 14 Aug signed defence pact; weeks later, Cairo 27 Aug delivered weapons to Mogadishu, prompting Ethiopias Foreign Ministry 28 Aug to accuse latter of colluding with external actors to destabilise the region. Addis Ababa next day sent new ambassador to Somaliland.",
        "severityScore": 90,
        "mediaScore": 62,
        "normalizedDifference": 0.3111111111111111
      },
      {
        "country": "Cameroon",
        "description": "Violence continued in Anglophone and Far North regions, while also flaring in previously calm North region; restrictions on critics continued ahead of 2025 election.",
        "detailedDescription": "Amid Anglophone separatist-related violence, UN rights chief urged dialogue. In Anglophone regions, Ambazonia rebels 7-9 Aug killed four police officers and one civilian in Bamenda town (North West, NW); military retaliation left at least one commercial motorbike rider dead. Suspected rebels 15 Aug burned five taxis in Bamenda. Roadside bombs 16-17 Aug exploded in Jakiri town (NW), killing one police officer. Rebels 24 Aug killed three police officers in Buea city (South West, SW) while military same day killed separatist fighter in Bambui township (NW). Anglophone rebels plan two-week lockdown around 9 Sept school resumption. UN human rights chief Volker Trk 5-7 Aug met with PM Ngute and key ministers, denouncing both separatist and army violations and lack of accountability, urged improved humanitarian access and dialogue; separatists criticised Trk for not visiting Anglophone regions. Jihadist-related insecurity continued in Far North. In Mayo-Sava department, soldiers 16 Aug killed suspected jihadist in Kolofata town while Boko Haram 22 Aug killed four civilians in Kerawa town; insurgents carried out raids to steal food, cattle and motorbikes in department throughout month. Militants 28 Aug reportedly killed seven special forces soldiers around Djibrilli locality, Mozogo commune, Mayo Tsanaga division, burning three patrol vehicles. Violence flared in North region. Bandits 20 Aug kidnapped seven farmers in Touboro commune along Central African Republic border but abandoned them after meeting military patrol; some eight others kidnapped in area in Aug. Political climate remained tense ahead of 2025 presidential election. Regulator early Aug banned two debate programs on private quinoxe Tlvision. Lawyer of social media activist Ramon Cotta 21 Aug confirmed client held by gendarmes in capital Yaound, following alleged late July extradition from Gabon. Meanwhile, apparent public calls by supporters endorsing President Biya in cities of Buea and Mamfe (both SW) 13 and 17 Aug respectively and Mokolo (Far North) 28 Aug suggested plans for his candidacy for 2025 poll. Electoral commission reported 7.9mn registered, under half of total eligible, ahead of 31 Aug registration deadline.",
        "severityScore": 80,
        "mediaScore": 87,
        "normalizedDifference": -0.08045977011494253
      },
      {
        "country": "Nigeria",
        "description": "Urban protests against economic and food crisis saw unrest amid looting and security forces crackdown; jihadist, bandit and other armed group violence persisted.",
        "detailedDescription": "Youth-led demonstrations turned violent amid mob looting and govt repression. Youth organisations 1 Aug began planned ten days of protests against govts handling of economic and food crisis. While demonstrations in northern cities and federal capital Abuja flustered authorities, leaderless nature of movement led to looting in some places; in response, authorities sought to suppress protests, including through curfews, arrests and use of tear gas and live ammunition. Rights group Amnesty International said demonstrations left at least 22 people dead by 7 Aug, while organisers reported over 1,400 arrested as protests lost steam. President Tinubu 4 Aug called for dialogue but offered no response to protesters demands. Army reported gains against jihadists in ongoing North East operations. In Borno state, air strikes 16 Aug killed at least 37 militants near Lake Chad; troops 17 Aug raided Boko Haram camp near Sambisa forest, killing three fighters including prominent commander Abu Rijab. Jihadists remained threat to civilians; in Yobe state, suspected Boko Haram fighters 30 Aug killed at least three students at religious school in Geidam area. Banditry remained widespread in North West and North Central. Notably in Benue state, gunmen 8 Aug killed 74 in Ayati town, Ukum area. In Niger state, bandits 19 Aug killed 13 farmers in Shiroro area. In Sokoto states Sabon Birni area gunmen 20 Aug killed emir of Gobir town, kidnapped in July. In Zamfara state, residents 28 Aug repelled attack in Talata Mafara area, which killed at least 37 bandits. Over 200 persons abducted for ransom during month. In other important developments. In Imo state, gunmen 3 Aug killed community leader and six village heads in Onuimo area. Enugu state govt 21 Aug said security forces in previous two weeks killed 27 including members of factional Biafra separatist group led by Finland-based agitator, Simon Ekpa. Members of Muslim sect 25 Aug clashed with police in Abuja; two police and unconfirmed others killed. In sign of rapprochement after months of heightened tensions, defence chief 28 Aug met Nigerien counterpart in Nigers capital Niamey.",
        "severityScore": 75,
        "mediaScore": 97,
        "normalizedDifference": -0.2268041237113402
      },
      {
        "country": "Uganda",
        "description": "Govt faced discontent over corruption and parliamentary expenditures, as authorities supressed protests; feud emerged among President Musevenis family.",
        "detailedDescription": "Public mistrust over legislatures spending grew, protest crackdown continued. Parliaments plans to spend roughly $5.4mn on four regional sessions outside capital Kampala sparked renewed public and political division; some opposition MPs 28-30 Aug boycotted inaugural session in northern city of Gulu, citing misuse of taxpayer funds. After large anti-corruption protests that saw hundreds of arrests in July, President Museveni 12 Aug urged activists to combat corruption without resorting to riots, while security forces denied having physically abused detained demonstrators. Repression of protests continued; notably, police in Kampala 5 Aug arrested 14 opposition officials and supporters protesting their colleagues detention and deportation from Kenya; 26 Aug arrested 18 students delivering petition against proposed pipeline to Energy Ministry. Meanwhile, collapse of rubbish dump in Kampala 9 Aug killed 35, with 28 missing, sparking internal govt dispute over accountability. High profile clash highlighted mounting tensions within Museveni family. Dispute emerged between head of army and Musevenis son Lt-Gen. Muhoozi Kainerugaba, and presidents son-in-law and advisor, Odrek Rwabwogo; both seen as potential successors to Museveni. Muhoozi 16 Aug accused Rwabwogo of corruption, labelling him biggest thief in Uganda and setting off days of reciprocal rounds of public accusations and insults. Museveni 17 Aug obliquely referred to dispute, urging parties to avoid unprincipled conflicts. In other important developments. South Sudanese officials alleged Ugandan soldiers crossed into South Sudan 11 Aug, detaining and flogging six locals for suspected illegal entry to Uganda; Kampala did not respond to allegations. Meanwhile, amid renewed refugee influx due to deteriorating security situation in North Kivu province in neighbouring DR Congo, military 16 Aug returned some 100 Congolese security personnel who early Aug fled across border. Court 23 Aug sentenced three Islamic State-affiliated Allied Democratic Forces members to between five- and ten-years imprisonment for foiled 2021 suicide bomb attack. East and Southern Africa",
        "severityScore": 70,
        "mediaScore": 78,
        "normalizedDifference": -0.10256410256410256
      },
      {
        "country": "Mozambique",
        "description": "Govt and Rwandan forces continued offensive against Islamic State militants in northern Cabo Delgado province; court barred opposition coalition from October elections.",
        "detailedDescription": "Counter-insurgency operations focused on coastal district Macomia. Rwandan and govt forces continued offensive against Islamic State Mozambique Province (ISMP) that began late July; though Maputo and Kigali communicated very little publicly about operations, forces reportedly targeted militant strongholds along coast and in Catupa forest. Area of fighting reportedly stretched from south of north-lying Mocmboa da Praia district down throughout Macomia to southern parts of district, as well as westward to areas along Messalo river and Catupa forest; conflict zones included strategically located Mucojo town which ISMP has occupied for several months. Early unconfirmed reports suggested insurgents may have suffered heavy casualties. Offensive included use of Rwandan combat helicopters, notably targeting insurgent positions in Mucojo; potential civilian casualties could damage Rwandan militarys good standing with local communities. ISMP remained threat in Muidumbe, Nangade districts. Explosive planted by militants on N380 road 9 Aug killed police truck driver in Muidumbe district. Group also maintained presence in Nangade district bordering Tanzania, with Tanzanian forces clashing with insurgents outside Nangade town; ISMP and joint Tanzanian- govt force 2 Aug reportedly fought around Namuine village; details remained unclear. Court confirmed opposition coalition banned from legislative and provincial ballot. Constitutional Council 1 Aug upheld July decision by electoral commission to bar opposition coalition Coligao Aliana Democrtica (CAD) from 9 Oct polls because its registration was invalid; CAD leader Venncio Mondlane, however, still allowed to run in presidential vote. Meanwhile, election observers criticised parliaments 8 Aug law that removed power of district courts  some of which overturned results favouring ruling FRELIMO party in 2023 municipal elections  to order recounts. Campaigning began 24 Aug.",
        "severityScore": 70,
        "mediaScore": 89,
        "normalizedDifference": -0.21348314606741572
      },
      {
        "country": "Burkina Faso",
        "description": "Large-scale violence continued while President Capt.",
        "detailedDescription": "Traor reported recent coup; military authorities continued with authoritarian tactics. Large-scale attacks underscored widespread violence and high civilian casualties. Suspected al-Qaeda-affiliated Group for the Support of Islam and Muslims (JNIM) jihadists 9 Aug attacked military convoy carrying over 1,000 civilians between Ougarou and Boungou towns, East region; local sources reported at least 130 soldiers, military auxiliaries and civilians killed or missing, with significant military equipment seized. JNIM 24 Aug attacked villagers digging trench to protect Barsalogho town, Centre-North region, reportedly killing hundreds; UN Sec Gen Guterres 27 Aug strongly condemned attack, which provoked domestic uproar. Other violence reported throughout month, in particular in Centre-North, East, Centre-East, Boucle du Mouhoun and Sahel regions. In East, unconfirmed local reports claimed at least 80 civilians killed during military 6-10 Aug anti-JNIM operations in Manni commune, East region. Amid insecurity, president talked of destabilisation attempt. During national TV broadcast, Traor 6 Aug alleged he had been subjected to and overcome recent coup; without providing specific details, president claimed security officials collaborated with jihadist groups supported by Western intelligence working from neighbouring country. Allegations remained unconfirmed but reports have emerged for several months of unrest within army, and July arrest of former senior military official may be related to incident; rumours of military instability likely to continue amid inability to address insecurity. Govts repressive tendencies persisted. Traor govt continued to silence dissent and any opposition to its interests; police 1 Aug arrested lawyer and civil society figure Guy-Herv Kam  for third time in 2024  for alleged involvement in destabilisation. Forcible enrolment in security forces continued; authorities 12 Aug ordered seven judicial officials to frontlines to fight jihadists; officials had reportedly been involved in recent legal decisions that went against figures close to govt. Magistrates union 15 Aug said decision intended as humiliation and intimidation and sabotage of the authority of justice. Unconfirmed social media reports mid- Aug alleged journalist previously sent to frontline had been killed. In another important international development. Denmark 26 Aug announced closure of embassies in Burkina Faso and Mali (see Mali).",
        "severityScore": 70,
        "mediaScore": 100,
        "normalizedDifference": -0.3
      },
      {
        "country": "Central African Republic",
        "description": "Prospect of ceasefire created cracks among rebel alliance; deadly violence on civilians persisted and govt postponed local elections.",
        "detailedDescription": "Ceasefire opportunity sparked divisions among rebels and govt. In 26 July document circulating publicly 4 Aug onwards, Gen. Ali Darassa, founder of Fulani- led Unity for Peace in Central African Republic (UPC) armed group, announced ceasefire and expressed willingness to seek compromise with govt aimed at restoring peace, security and social cohesion. Darassas decision, however, caused discord within Coalition of Patriots for Change (CPC) rebel alliance  which includes UPC and five other armed groups; some factions favour continuing violent struggle rather than entering dialogue. CPC general coordinator and former President Boziz  in exile in Guinea-Bissau  5 Aug dismissed Darassa as alliances chief of staff for high treason, saying Darassas move did not bind coalition, exposing rifts among rebels. Opinions also divided within President Touadras circle; presidential advisor Fidle Gouandjika 6 Aug argued for continued military action, but disarmament and reintegration minister Jean Wilibiro Sacko 8 Aug affirmed govts decision to pursue dialogue with Darassa. Govt also engaged in talks with representatives of Movement for Central Africa, armed group reportedly 1,000-strong based along border with Chad. Armed groups continued to cause harm to civilians. CPC fighters 8 Aug killed five traders in ambush in Gambo sub-prefecture, Mbomou prefecture. Despite formal incorporation into army, ethnic Azand militia fighters pursued aggressive stances against civilians; combatants 8 Aug conducted searches in Zemio town, Haut- Mbomou prefecture, arresting at least ten civilians, mostly Muslim traders, accusing them of collaborating with UPC rebels. Meanwhile, Return, Reclamation, Rehabilitation rebel group 13 Aug killed two Russian paramilitaries in ambush near mining site in Markounda sub-prefecture, Ouham prefecture. Govt postponed local elections over financial issues. Govt 22 Aug announced postponement of local and municipal elections  originally scheduled for Oct  to April 2025; decision related to funding challenges, as electoral body only raised around half of required budget. Although some opposition leaders welcomed decision and pressed for dialogue, opposition coalition Republican Bloc for the Defence of the Constitution continued to call for boycott of polls, demanding reform of electoral body.",
        "severityScore": 55,
        "mediaScore": 100,
        "normalizedDifference": -0.45
      },
      {
        "country": "Somalia",
        "description": "Al-Shabaab launched major attack in capital Mogadishu as post-AU mission security framework became clearer; Trkiyes mediation between Somalia and Ethiopia progressed slowly.",
        "detailedDescription": "Militants conducted largest attack in over year in capital. Al-Shabaab 2 Aug carried out complex attack including suicide bomb at beach restaurant in Mogadishu, killing at least 37 civilians and wounding over 200 in deadliest attack in city since Oct 2022; presidents office said it would design plans to strengthen capitals security. Also, suicide vehicle bomber 21 Aug killed at least five at security checkpoint on Mogadishus outskirts. Govt continued anti-Al-Shabaab operations including 13 Aug in Galcad district, Galmudug state (centre), killing ten militants and same day in Badhade district, Jubaland state (south), claiming to have killed 32. Replacement for AU mission (ATMIS) announced. AU 1 Aug approved plans for successor to ATMIS; AU Support Mission in Somalia (AUSSOM) to have some 12,000 personnel across 23 locations and run from Jan 2025 until Dec 2029; meanwhile, UN Security Council 15 Aug authorised ATMIS mandate extension until 31 Dec when it is replaced. Key questions, however, remain over transition from ATMIS to AUSSOM including financing and which countries will contribute troops. Clan violence persisted. Rival groups 19 Aug onwards clashed in Bidhaan-dheere area, Galgaduud region (Galmudug), reportedly killing at least four, including local mediator. Tensions with Ethiopia continued. Trkiye 12-13 Aug hosted second round of indirect talks between FM Fiqi and his Ethiopian counterpart Atskeselassie; although reports of positive progress emerged, discussions ended without deal as both Mogadishu and Addis Ababa stuck to positions regarding latters Jan announced agreement with Hargeisa; third round due to begin 17 Sept. Immediately after talks, President Mohamud 14 Aug travelled to Egypt to sign defence cooperation agreement in signal of govts continuing attempts to bolster international support; Cairo 27 Aug delivered military equipment to Mogadishu, prompting criticism from Addis Ababa (see Ethiopia). Meanwhile, govt late Aug began pressuring businesses including airlines and remittance companies to stop using Somaliland name (see Somaliland).",
        "severityScore": 55,
        "mediaScore": 20,
        "normalizedDifference": 0.6363636363636364
      },
      {
        "country": "Sudan",
        "description": "Fighting between Sudanese Army (SAF) and Rapid Support Forces (RSF) escalated in North Darfur, clashes subsided in east amid seasonal rains, and U.S.-led peace talks led to outcomes on aid deliveries amid deteriorating humanitarian crisis.",
        "detailedDescription": "North Darfur once more became epicentre of conflict. Hostilities escalated in North Darfur capital, El Fasher, as RSF early Aug launched major assault on city, reportedly killing and displacing hundreds. Other areas of North Darfur remained wracked by insecurity amid intensifying SAF bombardments. Notably, SAF mid-Aug bombarded Fasher and several other locations, including Taweisha town, resulting in significant casualties and retaliatory RSF strikes. SAF and allied Darfuri armed groups repeatedly attacked Kutum city, RSF stronghold with significant Arab population, raising risk of intercommunal clashes. SAF aerial bombardments also targeted East Darfur capital, Ed Deaein, killing and wounding dozens. Meanwhile, Integrated Food Security Phase Classification 1 Aug declared famine in North Darfurs Zamzam camp as humanitarian crisis worsened, exacerbated by heavy rains, which triggered displacement and cholera outbreaks. RSF made small advances further east as fighting slowed due to rainy season. Fighting further east persisted, though at slower pace amid seasonal rains. In El Gezira state, RSF 1 Aug killed dozens during attack on El-Adanab village, while SAF aerial bombardments in Hassaheesa town resulted in numerous casualties. In Blue Nile and White Nile states, RSF continued to advance slowly, 5 Aug attacking several villages in White Niles Al Gitaina locality; offensives indicate White Nile will likely become key RSF target when rainy season ends. In North Kordofan state capital, El Obeid, multiple RSF-SAF clashes left dozens dead. U.S.-led peace talks yielded outcomes on aid deliveries despite SAFs absence. Peace talks co-hosted by U.S., Switzerland and Saudi Arabia 14-23 Aug were held in Geneva, Switzerland; AU, UN, UAE and Egypt attended as observers. SAF was notably absent after insisting that talks focus on implementing May 2023 Jeddah Agreement and objecting to participation of UAE, RSFs main backer. While SAFs absence hindered progress toward national ceasefire, mediators 23 Aug announced they had secured commitments from parties to allow aid to flow into Darfur from Chad and enhance civilian protection. Sahel",
        "severityScore": 55,
        "mediaScore": 59,
        "normalizedDifference": -0.06779661016949153
      },
      {
        "country": "Mali",
        "description": "Amid persistent violence, impact of deadly July attack in north continued as govt severed relations with Ukraine; political climate remained tense.",
        "detailedDescription": "Fallout out from killings in Kidal region continued, including internationally. Following July attack around Tinzaouaten town  which was perhaps deadliest incident to date for Russian paramilitary group Africa Corps (formerly Wagner Group) in Mali  separatist Permanent Strategic Framework (CSP) armed coalition 1 Aug claimed to have killed 84 Russian and 47 Malian troops. Full picture of events remained unclear, including who inflicted most casualties between CSP and al- Qaeda-affiliated Group for the Support of Islam and Muslims (JNIM)  both involved in clashes but at different stages. Conflict continued in area with military carrying out multiple airstrikes near Tinzaouaten. Meanwhile, govt 4 Aug cut diplomatic relations with Kyiv after Ukrainian military official claimed support role in Tinzaouaten, including providing intelligence and training; authorities called this clear aggression and received support from Sahelian neighbours (see Niger). Ukraine 5 Aug said decision to cut ties was short-sighted and hasty without any evidence. Meanwhile, govt 23 Aug suspended French broadcaster LCI for two months after program covered attack. Jihadist-related violence persisted across north and centre. In north, Islamic State Sahel Province 16 Aug killed three civilians in Arhabou village, Gao region. In centre, JNIM 15 Aug killed at least 15 soldiers on patrol near Diallassagou town, Mopti region. Reports of abuses against civilians continued; Russian paramilitaries 5 Aug allegedly killed at least ten civilians in Toule village, Segou region (centre). Political climate remained tense as repression continued. Collective of lawyers 3 Aug expressed concern over disappearance of legal official from prison cell while PM Maga 5 Aug publicly criticised May arrest of political ally. Head of High Islamic Council 17 Aug called for dialogue with armed groups; draft charter from inter- Malian dialogue that ended in May  due to be submitted to govt in Sept  could open window for talks, although prospects remained uncertain. In other important international developments. Govt 9 Aug expelled Swedish ambassador after Sweden two days prior announced phase out of development aid; Denmark 26 Aug said it would close embassies in Mali and Burkina Faso (see Burkina Faso).",
        "severityScore": 55,
        "mediaScore": 100,
        "normalizedDifference": -0.45
      },
      {
        "country": "Benin",
        "description": "Diplomatic relations with Niger continued to warm; jihadist insecurity persisted, particularly in transboundary parks.",
        "detailedDescription": "Beninese-Nigerien ties slowly improved. Despite positive bilateral visits in July, Nigerien President Gen. Tiani 3 Aug reiterated claims Beninese govt was hosting French subversive elements working to destabilise Niger, said restoring relations would depend on assurances Benin posed no security threat. Steady de-escalation, however, continued despite rhetoric, with Nigerien authorities 6 Aug accepting credentials presented by new Beninese ambassador. In another sign of warming ties, govt 16 Aug authorised resumption of trade transporting Nigerien crude oil through Sm port; land border, however, remained closed. Jihadist violence continued in northern departments. Al-Qaeda-affiliated Group for the Support of Islam and Muslims 9 Aug killed two soldiers near Porga town, Atacora department; Porga one of main entrances to Pendjari National Park which remains vulnerable, along with W Park, to jihadist infiltration from Burkina Faso and Niger despite ongoing deployment of troops in area. In another important development. Beninese security forces 12 Aug reportedly seized and extradited govt-critical blogger alias Brother Hounvi from Togos capital Lom; opposition 19 Aug criticised arrest of blogger, whose trial on charges of publishing false news due to begin 7 Oct. Incident sparked tensions with Togo, as Beninese authorities allegedly did not inform Togolese counterparts about planned arrest (see Togo).",
        "severityScore": 50,
        "mediaScore": 81,
        "normalizedDifference": -0.38271604938271603
      },
      {
        "country": "Burundi",
        "description": "Preparations for 2025 elections continued amid further efforts to sideline opposition; concerns rose over condition of Burundian refugees in Tanzania.",
        "detailedDescription": "Measures for 2025 legislative polls faced scepticism. Electoral commission 2 Aug asserted readiness for upcoming 2025 legislative elections, citing sufficient budget. Concerns persisted, however, over underrepresentation of Muslim community members in electoral commission, absence of Catholic Church representatives and perceived short timeframe for appointing independent electoral commissioners. Meanwhile, opposition and local residents accused ruling CNDD-FDD party youth wing Imbonerakure of 19 Aug onwards forcibly coercing financial contributions to CNDD-FDD electoral campaign in Bujumbura, Makamba and Rutana provinces. Opposition continued to face state-sponsored harassment. Opposition coalition CNARED-GIRITEKA 13 Aug accused CNDD-FDD of disseminating false leaflets to discredit them and of escalating ethnic tensions. Security forces also continued repression of opposition; intelligence agents 2-3 Aug abducted three individuals in Bujumbura city, including opposition activist; SOS Media Burundi 7 Aug reported Imbonerakure members in Giharo district, Rutana, had raped wife of former ruling party activist who joined opposition UPRONA party. Amid oppressive climate, rights group Amnesty International 21 Aug issued report criticising wave of repression. Condition of Burundian refugees in Tanzania came to fore. Amid mid-Aug reports of detention and assaults of Burundian nationals near Nduta and Nyarugusu refugee camps, joint Burundian-Tanzanian delegation 6-7 Aug visited camps, affirming plans to repatriate tens of thousands by years-end. Meanwhile, locals 8 Aug reported Rwandan armed group presence in Bukinanyana district, Cibitoke province, alleging their involvement in extortion and theft near Kibira natural reserve, causing displacement among locals. More Imbonerakure members reportedly received paramilitary training in Cibitoke early Aug onwards, ahead of suspected deployment to DR Congo. In another important development. President Ndayishimiye 14 Aug granted presidential pardon to journalist Floriane Irangabiye, imprisoned since Jan 2023 for criticising govt, sparking hope of potential other amnesties.",
        "severityScore": 40,
        "mediaScore": 62,
        "normalizedDifference": -0.3548387096774194
      },
      {
        "country": "Kenya",
        "description": "Protests subsided amid govt restrictions, anti-Al-Shabaab operations continued, and international police mission to Haiti remained challenging.",
        "detailedDescription": "Demonstrations faded although political tensions stayed high. Nationwide protests against proposed finance bill that began in June and morphed into wider anti-govt movement gradually reduced throughout month. Decline partly due to authorities restrictions, notably, police 8 Aug closed major roads in capital Nairobi and fired tear gas to disperse few dozen protesters gathering as new cabinet sworn in; govt pressure on media groups may also have stymied local reporting during Aug. Political tensions, however, remained high over direction of President Rutos govt; court 2 Aug paused parliamentary nominations to selection panel which will choose electoral commissioners  part of concessions to protesters  after complaint from opposition Azimio coalition politician who was replaced as nominee. New finance minister John Mbadi 18 Aug said some tax proposals would be re-introduced while MPs 25 Aug began debate on controversial bill restricting protests. Meanwhile, Ruto 29 Aug said he was not aware of any abductions during finance bill demonstrations; rights groups reported dozens. Attacks bearing Al-Shabaab hallmark persisted in north east. Gunmen 10 Aug killed driver for govt official in Kamor area, Mandera county, in attack authorities blamed on Al-Shabaab. Security forces continued anti-militant operations including 5 Aug in Garissa, Mandera and Wajir counties and 15 Aug in Fafi district, Garissa, that killed two suspected Al-Shabaab members. Kenyan police continued mission in Haiti. 400-strong force  expected to eventually total 1,000  carried out more joint patrols and targeted operations near their base in Haitian capital Port-au-Prince (see Haiti). But challenges persisted including limited resources, uncertain funding, salary payment issues and need for reinforcements, including from other countries.",
        "severityScore": 40,
        "mediaScore": 93,
        "normalizedDifference": -0.5698924731182796
      },
      {
        "country": "Zimbabwe",
        "description": "Worsening human rights situation and widespread repression overshadowed annual regional SADC summit in capital Harare, drawing international criticism.",
        "detailedDescription": "Authorities continued crackdown on critics. Govt 17 Aug hosted summit of heads of state of southern African regional body SADC in capital Harare, with President Mnangagwa elected as organisations new chair. Ruling party ZANU-PF officials several times ahead of meeting said govt would take strong actions to prevent opposition from damaging Zimbabwes reputation by disrupting summit with protests. Security forces stepped up presence around meeting as tanks and anti-riot police reportedly patrolled city; increased security forces also present in Gweru, Kwekwe, Mutare cities and Chitungwiza town. Govt also continued repression in lead-up to summit; rights groups Amnesty International and Human Rights Watch reported authorities 1-9 Aug arrested 30 people including political figures. Police 15 Aug arrested former opposition MP and 11 others for allegedly attempting to spark protests in Gokwe town, Midlands Province, with eight remanded in custody after 27 Aug being denied bail; security forces 17 Aug arrested another former MP, Prince Dubeko Sibanda, at Beitbridge border with South Africa for inciting public violence and transported him to Harare, where he remained in custody. International actors condemned crackdown around summit. UN human rights office 14 Aug said it was concerned by reports of arrests, harassment and intimidation. U.S. embassy next day released statement affirming support for SADC summit goals of improving economic development and security, but said intimidation, torture and prolonged pre-trial detention...runs counter to these principles. Earlier, EU, UK and U.S. missions noted and criticised that lead-up to summit had seen intensified crackdown. SADC member states, however, including regional powerhouse South Africa, remained largely quiet on rising repression. Horn of Africa",
        "severityScore": 40,
        "mediaScore": 91,
        "normalizedDifference": -0.5604395604395604
      },
      {
        "country": "South Africa",
        "description": "Deputy leader of EFF opposition party defected to MKP party; gunmen targeted and killed local politicians.",
        "detailedDescription": "Opposition parties faced shake ups. Floyd Shivambu, deputy leader and co-founder of populist opposition party Economic Freedom Fighters (EFF), 15 Aug announced he had resigned from party and was joining largest opposition uMkhonto weSizwe party (MKP) led by former President Zuma to serve as national organiser; EFF leader Julius Malemas refusal to join President Ramaphosas unity govt reportedly informed Shivambus decision. MKP continued to face internal power struggles as party 8 Aug fired 15 MPs amid accusations of cronyism. Local govt representatives threatened by criminal violence. Amid continued worries over nexus between politics and organised crime, gunmen 19 Aug killed African National Congress (ANC) municipal executive at his home in KwaBhaca town, third murder of ANC leader in Eastern Cape province since Jan. Unknown gunmen 14 Aug shot and wounded Patriotic Alliance party councillor in drive-by after he attempted to mediate gang dispute in Kensington suburb, Cape Town city. Earlier in Johannesburg city, EFF ward councillor shot dead 4 Aug during protest against social housing evictions, with exact circumstances around death unclear; EFF leader Malema 9 Aug alleged councillor was assassinated.  Tanzania Police arrested hundreds of opposition members ahead of December local elections and 2025 general elections, sparking political tensions. Authorities 11-12 Aug detained hundreds of opposition figures from Chadema party including former presidential candidate Tundu Lissu, as well as multiple journalists, on eve of youth rally in Mbeya town (south west); police 13 Aug said in total 520 people were arrested for intending to hold prohibited conference, having previously banned rally for supposed security reasons. Authorities same day released on bail Chadema leaders and supporters, but party said some members of its youth wing (Bavicha) were still being held; Chadema 19 Aug reported and denounced new arrest of three party leaders in Temeke region previous day. Court 28 Aug ordered police to investigate whereabouts of disappeared Bavicha members, while police 30 Aug alleged Chadema were mobilising against them and warned actors not to disturb the peace. Arrests caused widespread consternation ahead of Dec local and 2025 general elections. Sec Gen of ruling Chama Cha Mapinduzi party 12 Aug urged govt to consider release of detainees. Rights group Amnesty International same day described arrests as arbitrary, said authorities intensifying intimidation of political opposition in run-up to elections; Human Rights Watch next day said detentions were bad omen for upcoming polls. U.S. embassy 14 Aug called for safe and open political space and criticised alleged excessive police force during arrests, saying it had resulted in injuries. Chadema 22 Aug and other main opposition ACT-Wazalendo party same day called for President Suluhu Hassans govt to reform police.",
        "severityScore": 35,
        "mediaScore": 54,
        "normalizedDifference": -0.35185185185185186
      },
      {
        "country": "South Sudan",
        "description": "Nairobi talks remained frozen after VP Machars party withdrew from initiative, 2018 peace deal signatories held talks about December elections, and border conflict with Uganda simmered.",
        "detailedDescription": "Nairobi peace talks remained stalled. Talks between govt and several opposition groups not party to 2018 peace agreement, dubbed Tumaini, remained on hold after Machars Sudan Peoples Liberation Movement-In Opposition (SPLM-IO) withdrew in July amid concerns initiative undermined 2018 deal. Kenyan mediation team and members of President Kiirs SPLM held talks late July-early Aug in capital Juba in hopes of persuading Machar to return to negotiating table. Other officials echoed Machars concerns, however; notably, Cabinet Affairs Minister Martin Elia Lomuro 8 Aug warned initiative risks dismantling peace deals achievements and urged better alignment between agreement and Tumaini. Kiir 28 Aug held talks with Tumaini delegates in Kenya, who reportedly sought to address Machars concerns in effort to resume talks. Meanwhile, representatives from govt and rebel group National Salvation Front (NAS) led by Thomas Cirillo 12-14 Aug discussed latters possible inclusion in Tumaini initiative, but Cirillo 17 Aug rejected invitation. Peace deal signatories discussed contentious December elections. Parties to 2018 peace agreement 13 Aug met to discuss elections, currently scheduled for Dec, amid disagreement about whether they should be postponed due to delays in preparation, lack of political consensus, scarce funds and insecurity. At request of peace deal signatories, institutions charged with organising polls 22 Aug submitted their report on feasibility of holding elections in Dec. Ugandan forces reportedly crossed into South Sudanese territory. On-off border conflict between South Sudan and Uganda, which resurfaced late June, continued amid reports of incursions by Ugandan forces into South Sudanese territory. Notably, Ugandan forces 11 Aug allegedly entered Kajo-Keji County (Central Equatoria State) and flogged six civilians for entering Ugandan territory. Authorities in Magwi County (Eastern Equatoria State) 27 Aug claimed Ugandan forces were encroaching on their land and harassing civilians. Economic crisis persisted. South Sudans main oil pipeline running through Sudan remained in disrepair, exacerbating economic crisis. Malaysian oil company Petronas 9 Aug announced it would exit country after 14 years, in part due to mounting costs incurred by rupture, marking major financial blow.",
        "severityScore": 35,
        "mediaScore": 69,
        "normalizedDifference": -0.4927536231884058
      },
      {
        "country": "Chad",
        "description": "Govt tightened its authoritarian grip as debate over constituencies and parliament continued; local elections called for December.",
        "detailedDescription": "Authorities silenced dissent following adoption of several bills. Controversy continued over late July laws on electoral boundaries and composition of parliament  both promulgated 16 Aug  that critics claim gerrymander in favour of northern provinces loyal to current regime, highlighting divisions between regions. Security forces 5 Aug stormed Catholic church in capital NDjamena and arrested Father Madou Simon-Pierre, southerner and critic of new law. Arrest sparked outrage, forcing authorities to release him next day. Govt 9 Aug banned conference of opposition coalition Federal Bloc  which advocates federalism  for disturbing public order. In further sign of regimes authoritarian drift, armed men 7 Aug arrested Oumar Ali Badour, editor-in-chief of Tchadinfos news site. Authorities did not comment on arrest, sparking outrage among journalists; Badour released next day. Intercommunal violence continued. Altercation between herder and farmer 10 Aug after cattle destroyed latters field left farmer injured in Bouna sub-prefecture, Mandoul region; clash between farmers and herders 27 Aug killed civilian and wounded others near Mao city, Kanem region. Local elections called for Dec. Electoral body 21 Aug announced legislative, provincial and municipal elections will be held 29 Dec. Authorities said existing electoral register will be used due to lack of time, material and financial resources. Ruling-Patriotic Salvation Movement party said elections would allow return to constitutional order by year-end but opposition criticised timing as rushed without fully resolving long-standing issues including constituency boundaries. In other important developments. Rights group Human Rights Watch 6 Aug released report accusing army of torture, inhumane treatment and forced labour at Koro-Toro prison, 600km north of NDjamena in desert; govt next day rejected report, calling it diplomatic conspiracy and threatening legal action. Meanwhile, Mediapart newspaper 23 Aug reported French authorities had opened investigation into Dbys property holdings in France, allegedly valued at 30mn, reportedly fuelling NDjamena-Paris tensions. Aid trucks began crossing border into Sudans Darfur region after agreement by various Sudanese parties (see Sudan). Great Lakes",
        "severityScore": 30,
        "mediaScore": 100,
        "normalizedDifference": -0.7
      },
      {
        "country": "Somaliland",
        "description": "New opposition alliance emerged ahead of November elections; govt defended agreement with Ethiopia.",
        "detailedDescription": "Main opposition party formed major political coalition, electoral tensions fuelled deadly clash. Opposition Waddani party and Kaah political association 4 Aug formalised long-rumoured alliance to challenge President Bihis Kulimye party in 13 Nov concurrent party and presidential elections; Kaah will support Waddanis presidential candidate Abdirahman Irro. Campaigning picked up mid-Aug onwards as Kulmiye and Waddani officials began regional tours. Meanwhile, electoral body 22 Aug reached agreement with govt and opposition on use of biometric voter verification system, removing previous point of contention. Clan militia allegedly upset with electoral proceedings 25 Aug clashed with security forces in Baligubadle town, Maroodi Jeex region with reportedly one killed; armed group stood down after quick intervention of elders. Security forces clashed with Dhulbahante clan in Sanaag region. Govt forces and Dhulbahante members 27 Aug clashed in Erigabo town; further clashes erupted between opposing clans in Goof village next day, leaving at least five dead. Authorities from both Somaliland and SSC-Khatumo (self-declared administration for Dhulbahante community) blamed each other for violence. Govt responded to Turkish mediation of Ethiopia-Somalia dispute (see Somalia). Amid talks in Trkiyes capital Ankara aimed at resolving tensions over Jan- announced Ethiopia-Somaliland Memorandum of Understanding over sea access and diplomatic recognition, govt 13 Aug criticised Trkiye for lack of impartiality and aiming to interfere, reiterating commitment to Ethiopia deal; Bihi 29 Aug accepted credentials of new Ethiopian ambassador. Meanwhile, Bihi 26 Aug denounced Somalias pressure on businesses including airlines and remittance companies to stop using Somaliland name. Earlier, govt 1 Aug established ministerial committee to promote recognition.",
        "severityScore": 30,
        "mediaScore": 100,
        "normalizedDifference": -0.7
      },
      {
        "country": "Rwanda",
        "description": "Regional diplomatic efforts to ease tensions with DR Congo (DRC) intensified amid continued war of words between Kigali and Kinshasa.",
        "detailedDescription": "Angolan mediation continued to gain some traction despite persistent aggressive Rwandan and Congolese rhetoric. During inaugural address as he was sworn in for fourth term, President Kagame 11 Aug criticised Kinshasas handling of crisis in eastern DRC, although he praised mediation by Angolan President Loureno and Kenyan President Ruto. Earlier, Congolese President Tshisekedi 6 Aug called Kagame criminal and said he wanted to ask him why he is killing in my country. In continued Angolan-led efforts, Loureno met with Kagame on sidelines of inauguration and following day met Tshisekedi in DRC capital Kinshasa; members of southern African regional body SADC  which has deployed security force in eastern DRC  17 Aug endorsed Lourenos peace diplomacy. Series of further tri- lateral meetings took place in Angolan capital Luanda; intelligence experts from Angola, DRC and Rwanda 7 Aug reviewed joint plan to combat anti-Rwandan militia Democratic Forces for the Liberation of Rwanda, key Kigali demand. Later, Rwandan FM Nduhungirehe and Congolese counterpart Wagner 20-21 Aug met for third ministerial meeting, amid hopes engagement could lead to Kagame-Tshisekedi summit; event, however, ended without any compromise, with further ministerial meeting scheduled for 9-10 Sept in Luanda. As fighting continued on ground in DRC, Kinshasa 29 Aug announced it filed case against Kigali at East African Court of Justice, accusing Rwanda of violating its sovereignty and of crimes against civilians.",
        "severityScore": 20,
        "mediaScore": 95,
        "normalizedDifference": -0.7894736842105263
      },
      {
        "country": "Togo",
        "description": "Jihadist violence continued to plague north; tensions with Benin flared over bloggers arrest.",
        "detailedDescription": "Northern regions remained vulnerable to jihadist activity, particularly along Burkina Faso border; homemade bomb planted by al-Qaeda-affiliated Group for the Support of Islam and Muslims 7 Aug killed three soldiers in Kankanti area, Savanes region. Meanwhile, bilateral tensions with Benin flared after Beninese security forces 12 Aug reportedly seized and extradited Beninese blogger from capital Lom without communicating with Togolese counterparts (see Benin); govt 25 Aug announced it had detained one Togolese and one Beninese national in relation to incident.",
        "severityScore": 20,
        "mediaScore": 91,
        "normalizedDifference": -0.7802197802197802
      },
      {
        "country": "Guinea",
        "description": "Debates over transition to civilian rule continued after draft constitution unveiled; civil society leaders remained missing.",
        "detailedDescription": "Draft sparked concern over President Gen. Doumbouyas potential candidacy in future polls. After late July long-awaited presentation, govt 11-12 Aug publicly released new draft constitution to be submitted to referendum before end 2024. Civil society and opposition including coalition National Alliance for Alternation and Democracy (ANAD) questioned certain proposed measures. While draft includes limiting presidential terms to two, creating new bicameral legislature and allowing independent candidacies for first time, it does not bar transitions head Doumbouya from running for president in future (unlike transitional charter), potentially paving way for him to stay in office. Meanwhile, new age limit provision disqualifies Doumbouyas opponent, former President Cond, who he deposed in 2021 coup. Transitional official 8 Aug remained vague on prospect of Doumbouyas candidacy. Opposition called for shutdown, two civil society leaders still missing. Main opposition collective Forces Vives de Guine (FVG) 6 Aug called for 12 Aug general strike in capital Conakry to protest against military authorities and for return to civilian rule by 31 Dec, also denouncing continued mystery surrounding July disappearance of civil society leaders Fonik Mengu and Mamadou Billo. Strike, however, only marginally observed, amid heavy police presence and govt ban on demonstrations in place since 2022. Meanwhile, govt made no progress in reconciliation with exiled political leaders including former PM Diallo. In another important development. Lawyers for former President Camara 1 Aug said they would appeal his previous day conviction of 20 years imprisonment for crimes against humanity; case related to 2009 massacre of some 150 protesters in capital Conakry.",
        "severityScore": 15,
        "mediaScore": 100,
        "normalizedDifference": -0.85
      },
      {
        "country": "Eritrea",
        "description": "Asmara strengthened relations with Cairo and Moscow; authorities reportedly arrested 31 Yemeni fishermen over disputed Hanish islands issue.",
        "detailedDescription": "Asmaras ties with Cairo and Moscow deepened. FM Osman Saleh 8 Aug met with Egyptian President Abdel Fattah el-Sisi in Egypts capital Cairo to discuss issues and threats in the Horn of Africa and Red Sea; Egyptian FM Badr Abdel-Aty and Director of Egyptian General Intelligence Service Abbas Kamel also attended. Govts, both of which have uneasy relations with Ethiopia, expressed commitment to continued coordination in addressing regional threats. Comments follow Feb meeting between Sisi and President Isaias Afwerki, in which they stressed need to protect Somalias sovereignty following Ethiopia-Somaliland port deal. Meanwhile, Russian Deputy FM Mikhail Bogdanov and Eritrean Charg dAffaires Naizghi Hagos 12 Aug met in Russian capital Moscow; pair confirmed their focus on deepening political dialogue and close coordination of approaches in international fora. 31 Yemeni fishermen reportedly detained over disputed Hanish islands issue. Amid long-running dispute between Yemen and Eritrea over Hanish islands, Asmara 22 Aug reportedly released 31 Yemeni fishermen detained three days earlier; fishermen accused authorities of torture and starvation during their detention.",
        "severityScore": 5,
        "mediaScore": 52,
        "normalizedDifference": -0.9038461538461539
      }
    ],
    "Correlation": 0.029890928708543284
  },
  {
    "Region": "Asia",
    "Events": [
      {
        "country": "Afghanistan",
        "description": "Taliban strengthened regional ties, including with Uzbekistan, and banned UN special rapporteur on human rights from country; jihadist group IS-KP claimed deadly attack.",
        "detailedDescription": "Taliban authorities engaged in regional and international diplomacy. Uzbekistan PM Abdulla Aripov 17 Aug arrived in capital Kabul, first visit by any prime minister to capital since Taliban takeover. Parties signed 35 bilateral trade and investment agreements worth $2.5bn. United Arab Emirates (UAE) 22 Aug confirmed Mawlawi Badreddin Haqqani as Talibans representative in UAEs capital Abu Dhabi; while UAE does not formally recognise de facto Taliban administration, Haqqanis appointment is significant for being only second of its kind after China accepted Taliban envoy in Jan 2024. Kazakhstan deputy FM Alibek Bakayev 22 Aug accepted Taliban nominee, Muhammad Ur Rehman Rahmani, as Afghanistans Charg dAffaires as sides seek to enhance bilateral economic and aid cooperation. Previously, Talibans prime minister office 10 Aug stated it sent 41 officials to China for professional training. Authorities imposed travel ban on UN rights rapporteur. Taliban spokesperson Zabihullah Mujahid 20 Aug told local media that de facto authorities banned Richard Bennett, UN Special Rapporteur for human rights in Afghanistan, from entering country, alleging he was assigned to spread propaganda in Afghanistan. Bennett next day criticised ban as step backwards, reiterated commitment to impartially document and assess rights violations. Taliban Emir 8 Aug issued decree announcing judicial punishments for govt officials who miss congregational prayers. Morality law 22 Aug announced codified Taliban social restrictions, notably limiting womens rights and curtailing press freedoms. IS-KP launched deadly attack. Islamic State-Khorasan Province (IS-KP) 11 Aug claimed responsibility for explosion that targeted bus carrying Hazara civilians in capital Kabul; attack left one killed and injured thirteen. In another incident, six people 22 Aug died in mine blast in Dara Noor district. In other important developments. Authorities 18 Aug held military parade at former U.S. airbase in Bagram, Parwan Province, to celebrate three-year rule; Chinese and Iranian officials attended. Central Bank 7 Aug doubled weekly cash withdrawal limit for individuals from $1,000 to $2,000, also raising monthly limit from $3,000 to $6,000.  Bangladesh After anti-govt protests prompted PM Hasina to flee country, calm returned as new interim government took over; scores of Rohingyas sought safety in countrys south east. Amid heightened violence, PM Hasina fled to India. Anti-govt protests early Aug resumed after curfew was eased and internet partially resumed, leading to around 100 people 4 Aug killed during crackdown. As army refused to enforce curfew and protests persisted, PM Hasina 5 Aug resigned, fled to India. In subsequent days, several hundred more people were killed, many in reprisal attacks against ruling Awami League (AL) party supporters. Minorities, particularly Hindus, were also targeted, although most attacks seemed politically motivated  due to AL links  rather than religiously motivated. Nobel Laureate Muhammad Yunus appointed as interim leader. Acting press secretary 7 Aug announced decision to name Muhammad Yunus as chief advisor after talks between student protest organisers, military leaders, and civil society actors. Interim govt 8 Aug took oath as Yunus appointed most diverse cabinet in Bangladeshs history, including student leaders, human rights activist and former diplomats. Yunus pledged to undertake meaningful and deep reforms, saying that free and fair elections would be held after interim govt fulfils mandate of carrying out necessary reforms. Thus far, interim govt has replaced heads of Supreme Court and Bangladesh Bank and detained former members of Hasinas govt for corruption and murder investigations; 29 Aug signed convention on enforced disappearances. While public optimism for interim govt is strong, Yunus faces considerable obstacles for reform without mandate to pass laws or amend constitution. Opposition Bangladesh Nationalist Party is backing interim govt but has called for timeline on elections. Intense fighting in Myanmars Rakhine state forced hundreds to flee. Arakan Army (AA)s escalating attacks against regime forces in northern Rakhine states Maungdaw town killed scores and prompted some Rohingyas to try and reach Bangladesh. Notably, drone attack 5 Aug killed up to 200 Rohingya civilians who attempted to cross Naf river into Bangladesh (see Myanmar). NGO Mdecins Sans Frontires 9 Aug reported spike in arrivals of war-wounded Rohingya civilians from Myanmar; authorities 9 Aug said they recovered 34 bodies from Naf River after boat 6 Aug capsized.",
        "severityScore": 90,
        "mediaScore": 78,
        "normalizedDifference": 0.13333333333333333
      },
      {
        "country": "Pakistan",
        "description": "Former PM Imran Khan unsuccessfully attempted to mend relations with military as bilateral tensions with Kabul remained high amid persistent militant attacks.",
        "detailedDescription": "Relations between army and Khan plummeted further. Hoping to resurrect political prospects, Khan 5 Aug said it would be foolish not to have excellent relations with military. However, Khans relations with military subsequently further deteriorated. Military 12 Aug said it detained General (retired) Faiz Hameed, former general director of Pakistans Inter-Services Intelligence (ISI) agency, first ISI chief to be arrested, for multiple violations of Pakistan Army Act post-retirement. As ISI chief, Hameed was Khans close confidante and had reportedly overseen alleged rigging that brought Khans Pakistan Tehreek-e-Insaf (PTI) to power in 2018. Military 15 Aug arrested three other retired officers saying investigations would continue against all accused for collusion with vested political interests. Meanwhile, parliament 7 Aug amended Election Act 2017 to prevent PTI from benefitting from 12 July court ruling that granted PTI seats reserved for minorities and women. Insurgencies persisted in provinces bordering Afghanistan. Four soldiers and six militants 12 Aug died after clashes near checkpoint in South Waziristan, Khyber Pakhtunkhwa (KP); four soldiers along with 25 militants 28 Aug killed in KPs Khyber district. In Balochistan province, series of militant attacks 24-25 Aug across several districts left at least 50 dead including civilians and 14 soldiers, paramilitary personnel and police; separatist Balochistan Liberation Army claimed responsibility. Counter-insurgency operations subsequently reportedly killed dozens of militants; notably, military 30 Aug stated five militants killed in retaliation in southwest Balochistan. Relations with Kabul remained strained. Foreign ministry 1 Aug said UN sanctions committee endorsed Pakistans concerns about TTP and banned its collaboration with Afghan Taliban. To ease tensions, army chief Asim Munir 14 Aug asked Kabul not to choose TTP over Pakistan. However, tensions simmered after militants 18 Aug attempted to infiltrate into KPs Bajaur district, killing three soldiers. Two days later, another Pakistani soldier died in armed clashes with Afghan forces in Balochistans Noshki area along disputed border.",
        "severityScore": 60,
        "mediaScore": 100,
        "normalizedDifference": -0.4
      },
      {
        "country": "Thailand",
        "description": "Court disbanded Move Forward Party (MFP) as new PM Paetongtarn Shinawatra, daughter of former PM Thaksin Shinawatra, took office amid ongoing violence in deep south.",
        "detailedDescription": "Constitutional court dissolved MFP as over 140 MPs joined new opposition party. Constitutional Court 7 Aug dissolved main opposition MFP in unanimous decision; court banned MFPs eleven party executives, including party leader Pita Limjaroenrat, from holding office for ten years. Human rights groups and UN Human Rights Chief Volker Turk immediately criticised ruling. Meanwhile, all 143 MFP MPs, who retained seats in parliament, 9 Aug joined freshly formed Peoples Party or Prachachon, with tech entrepreneur Natthaphong Ruengpanyawut as party leader. Sec-Gen of National Anti-Corruption Commission Office 8 Aug said agency had ordered investigation of 44 former MFP MPs, including Natthaphong, for alleged breach of ethical standards by sponsoring bill to amend Article 112 of the Criminal Code. New PM Paetongtarn Shinawatra elected unopposed. Constitutional Court 14 Aug dismissed PM Srettha Thavisin for ethical violations. House of Representatives 16 Aug elected Paetongtarn Shinawatra as new PM; Paetongtarn is widely seen as proxy for her father, former PM Thaksin Shinawatra. Royal Gazette 17 Aug reported decree that pardoned Thaksin for his 2008 conviction. Deep south peace talks continued as militants staged attacks. Former PM Srettha 3 Aug met Malaysian PM Anwar Ibrahim in Sungai Kolok, Narathiwat province, on Malaysian border, reportedly discussed Deputy PM and Minister of Interior Anutin Charnvirakuls role working with Malaysias security sector to end conflict. Narathiwat Provincial Court 23 Aug accepted case brought by families of victims of Oct 2004 Tak Bai incident, in which 85 Malay-Muslim men were killed. Meanwhile, low-level violence continued in deep south. Notably, security forces 1 Aug clashed with insurgents, killing three, in Khok Pho district, Pattani province; rangers on patrol 4 Aug detonated landmine killing one in Raman district, Yala province; security forces 8 Aug engaged in firefight with militant in Chanae district, Narathiwat, which left one militant dead; militants 9 Aug detonated three IEDs near Pattani Provincial Police Investigation Division, injuring nine police officers. Four assailants 11 Aug threw pipe bombs at Marine Corps checkpoint in Bacho district, Narathiwat, injuring one marine. Pacific",
        "severityScore": 60,
        "mediaScore": 59,
        "normalizedDifference": 0.016666666666666666
      },
      {
        "country": "Myanmar",
        "description": "Ethnic armed group captured militarys north east command, military chief faced major criticism for loss, and Arakan Army (AA) pursued attacks on regime forces in Northern Rakhine, which could fuel more civilian violence in coming weeks.",
        "detailedDescription": "Military lost first regional command in northern Shan state. Myanmar National Democratic Alliance Army (MNDAA) and allies 3 Aug took control of Lashio town, capital of northern Shan State after launching attack previous month and just five days of heavy fighting on fortified headquarters. With more than 4,000 soldiers in MNDAA custody, Lashios fall represents major blow to military as NE Command is first of 14 regional commands to be lost to ethnic armed group. Military 2 Aug bombed hospital in Laukkai city, Kokang area, northern Shan, killing ten civilians. Military chief blamed foreign countries for fall, faced major criticism. Military chief Min Aung Hlaing 5 Aug addressed nation and warned about foreign interference, taking indirect aim at China without mentioning fall of Lashio. Nationalist monk Wirathu 8 Aug criticised Min Aung Hlaing, questioned whether he really wanted to win the war. Regime supporters also directed their anger at people of Chinese descent with anti-MNDAA and anti-Chinese pamphlets distributed in Mandalay city, along with threats to burn Chinese homes if city is attacked. Chinese FM Wang Yi 14 Aug stopped over briefly in capital Naypyitaw to discuss border security and protection of Chinese nationals, and investments in Myanmar. AA continued attacks on pro-regime forces, denied deadly attack on civilians. AA launched fresh attacks against regime positions in Maungdaw town, as it attempts to force military out of northern Rakhine. AA 24-26 Aug said it recovered bodies of more than 100 soldiers and Muslim fighters; dozens more have been captured. Rohingya activists clamed AA for 5 Aug attack, which reportedly left around 200 Rohingya civilians dead; group denied involvement claiming to have evacuated more than 20,000 Rohingyas to north and south of Maungdaw. AA 30 Aug reported entering regime naval base, south of Rakhines Thandwe city. In another important development. Military 7 Aug struck Kachin Independence Army-controlled border town of Laiza, Kachin state, hitting two churches; Chinese forces fired warning shots in response.",
        "severityScore": 45,
        "mediaScore": 82,
        "normalizedDifference": -0.45121951219512196
      },
      {
        "country": "India",
        "description": "-Pakistan (Kashmir) Uptick in militant attacks in Jammu region continued, and govt announced regional elections after ten-year gap.",
        "detailedDescription": "Worsening security situation in Jammu continued to raise concern. Security forces continued to suffer losses in Jammu region, raising alarm with govt. Police 12 Aug arrested nine people for allegedly facilitating movement of militants infiltrating from Pakistan in upper reaches of Doda, Udhampur and Kathua districts, Jammu region; security forces 14 Aug killed one militant in Doda where one soldier also died. Militants 19 Aug also ambushed and killed police officer in higher reaches of Udhampur district. Recent surge in militancy prompted home ministry 3 Aug to announce deployment of two counter-insurgency battalion of Assam Rifles with soldiers stationed in upper reaches of Jammu region. Meanwhile, in Kashmir, militants 10 Aug killed two soldiers and injured two civilians in gun battle in Anantnag district; security forces 24 Aug killed militant during security operation in north Kashmirs Baramulla district, and 28-29 Aug killed three militants in two different operations in north Kashmirs Kupwara district. Election Commission announced regional elections. Officials 16 Aug announced voting for Kashmir 90-member legislative assembly would start in Sept. Polls are expected to take place in three phases from 18 Sept to 1 Oct, with results to be announced on 4 Oct. Upcoming election will be regions first in ten years, and also first polls to be held after Jammu & Kashmir (J&K) restructuring in 2019 as Union Territory. With expanded powers since July, Lieutenant Governor 16 Aug reshuffled nearly 200 middle and upper-rung officers in civil administration and police department; regional parties immediately criticised move, seen as biased intent to influence poll outcomes in favour of ruling Bharatiya Janata Party (BJP). Former J&K Chief Minister Omar Abdullah 16 Aug asked election commission to view such transfer orders from prism of free and fair polls.",
        "severityScore": 35,
        "mediaScore": 100,
        "normalizedDifference": -0.65
      },
      {
        "country": "India",
        "description": "Leaked audio recording surfaced alleging that Chief Minister played role in fuelling ethnic tensions in Manipur, tensions with China over border issues persisted, and Maoist violence decreased.",
        "detailedDescription": "Chief Ministers role in Manipur ethnic conflict brought under scrutiny. Kuki Students Organisation (KSO) 7 Aug published transcribed excerpts of audio recording in which Chief Minister N. Biren Singh allegedly supported using mortar bombs against Kuki-Zo community. Manipur govt same day denied allegation, calling audio doctored. Media outlet The Wire 19 Aug stated commission on inquiry for Manipur, set up in 2023, would investigate audio recording. Ten Kuki-Zo lawmakers 21 Aug asked for Singhs resignation saying recording established his complicity beyond an iota of doubt; Aam Aadmi Party 20 Aug also called for Singh to resign. Singh 29 Aug defended administrations record, dismissed calls for resignation; Kuki-Zo 31 Aug held large rallies asking him to step down. Meanwhile, insecurity persisted. Notably, Sapam Charubala, wife of former legislator 10 Aug died in explosion at home; unidentified perpetrators 17 Aug threw explosives into home of former lawmaker, Nahakpam Indrajit and 20 Aug fired five rounds from automatic weapons at college principals home. Relations with China remained tense, satellite imageries confirmed new 400-metre Chinese wall at disputed border. Chinese state media 1 Aug reported sides agreed to consider each others reasonable concerns pertaining to border issues in order to reach consensus as soon as possible; statement published day after media outlet NDTV 31 July revealed that China completed construction of 400-metre bridge connecting northern and southern banks of Pangong Tso on Line of Actual Control. FM Jaishankar 31 Aug said India has a special China problem, called for scrutiny over investments from China. Maoist-related violence and anti-Maoist operations decreased. Maoists 20 Aug killed female cadre, Neelso alias Banti Radha, in Telangana state in border area with Chhattisgarh state, for being covert operative; attackers next day said Radha was killed for betraying party leadership by collaborating with police and had been removed as commander three months ago. National Investigation Agency 13 Aug filed charges against four Maoists after arresting them with weapons from Kanker district in Chhattisgarh.",
        "severityScore": 30,
        "mediaScore": 98,
        "normalizedDifference": -0.6938775510204082
      },
      {
        "country": "China",
        "description": "Japan China maintained military presence around disputed waters and Japan and U.S. conducted bilateral military exercises.",
        "detailedDescription": "Beijing maintained military presence around disputed waters. Japanese Defence Ministry Joint Staff Office 9 Aug released report indicating that Chinese electronic warfare drone flew within its Air Defence Identification Zone (ADIZ) over waters south of Miyako Strait after passing through contested East China Sea. Japan 12 Aug confirmed sighting 261 miles south of Miyako Island of Chinese navy strike group deployed to Philippine Sea; Japan 17 Aug also identified and surveilled advanced Chinese amphibious assault vessel and destroyer while pair sailed through Miyako Strait. Japan 27 Aug claimed Chinese military aircraft previous day unprecedentedly entered Japanese airspace, asserting incident was serious violation of our territorial rights. As of 30 Aug, 113 Chinese vessels were spotted in Japanese contiguous waters for 29 days and 12 vessels stayed in Japanese territorial waters over five days during the month. U.S. and Japan conducted military exercise, China rejected such joint patrols. U.S and Japan 7 Aug wrapped up 11-day annual bilateral exercise Resolute Dragon, which took place across Japan; activities aimed to bolster cooperation and focused on defence of south-western islands to counter Chinese military activity; notably, U.S. Marine Corps 12th Marine Littoral Regiment 4 Aug reported deployment of multi-mission radar system to Yonaguni Island for first time. In other important developments. Japanese PM Fumio Kishida 14 Aug announced he will not run in presidential election of ruling Liberal Democratic Party slated for September. Chinese Foreign Ministry 22 Aug told press that Chinese prosecutors have indicted Japanese citizen on suspicion of espionage.",
        "severityScore": 20,
        "mediaScore": 100,
        "normalizedDifference": -0.8
      },
      {
        "country": "Indonesia",
        "description": "Authorities blamed Papuan separatists for killing New Zealand pilot in Papua; authorities signed major defence deal with Australia.",
        "detailedDescription": "Police accused separatists for killing New Zealand pilot in Central Papua province. Security forces reported that separatist fighters 5 Aug shot dead male pilot from New Zealand when his helicopter landed in Alama village, Mimika district, Central Papua province, while releasing all four Indigenous Papuan passengers on board the aircraft. Killing comes nearly 18 months after the abduction by separatists in Feb 2023 of another pilot from New Zealand, Philip Mehrtens, who remains captive. President held celebrations in planned new capital, thousands protested revisions to electoral law. Outgoing President Joko Widodo 17 Aug celebrated countrys 79th Independence Day in planned new capital Nusantara, carved from East Kalimantan Province on Borneo Island, amid concerns about construction delays and funding gaps. Widodo 19 Aug reshuffled cabinet in surprising late-term move that analysts say would bolster incoming administration of Defence Minister Prabowo Subianto, who won Febs presidential election, by positioning key allies to maintain continuity and counter opposition. Prabowo 19-20 Aug visited Australia on his first visit since Indonesias general election in Feb 2024. Thousands of people 22 Aug protested against proposed revisions of countrys electoral law to permit candidates under 30 years old to compete, clashing with police which arrested about 300 people; critics alleged that reform would boost Widodos efforts to further solidify power, for example by allowing his youngest son Kaesang Pangarep to run for provincial governor in Javas local elections in Nov. Parliament same day decided not to proceed with proposed changes. Authorities signed new Defence pact with Australia. Australia and Indonesia 29 Aug signed new defence deal, with provisions on maritime security, counter terrorism, humanitarian and disaster relief, logistics support, education and training, cementing closer ties between two countries.",
        "severityScore": 15,
        "mediaScore": 96,
        "normalizedDifference": -0.84375
      },
      {
        "country": "Sri Lanka",
        "description": "Sri Lanka prepared for Sept presidential elections, greenlighting 39 candidates; IMF warned country at critical juncture, should sustain economic reform.",
        "detailedDescription": "Record 39 candidates to take part in upcoming presidential elections. Electoral commission 15 Aug accepted largest-ever number of candidates, with 39 nominations, for 21 Sept presidential election, though the race is widely seen as a three-way battle between president Ranil Wickremesinghe, opposition leader Sajith Premadasa of Samagi Jana Balawegaya party and Anura Kumara Dissanayake, leader of the leftist National Peoples Power (NPP) coalition. Both Premadasa and Dissanayake pledging to fight corruption and renegotiate bailout deal with International Monetary Fund (IMF) to better protect lower-income voters from economic austerity measures. In a blow to Wickremesinghe, the Sri Lanka Podujana Peramuna (SLPP), expected to back the president, 7 Aug announced its candidate would be Namal Rajapaksa, 38-year-old son of former president Mahinda Rajapaksa and nephew of ousted president Gotabaya Rajapaksa; move is seen as a bid by prominent Rajapaksa family, ousted from power in July 2022, to maintain political control of the SLPP, most of whose party legislators are backing Wickremesinghe. Wickremesinghes reputation took a blow after 22 Aug Supreme Court ruling found him guilty of arbitrary and unlawful conduct in postponing local elections, initially due in March 2023, ordering govt to hold polls as soon as possible after the presidential vote. IMF urged tax raise, commended progress of economic reform efforts. During 25 July-2 Aug staff visit, IMF commended economic reform efforts, but 2 Aug warned that country was at critical juncture and that to maintain economic stability and ensure efforts to reform economy are successful, authorities need to finalise debt restructuring agreements and redouble efforts to raise fiscal revenue. Next progress review is due after Sept presidential elections, outcome of which may influence policy changes. In line with 2023 Anti-Corruption Act, championed by IMF, president Wickremesinghe and 135 members of parliament provided declarations of assets and liabilities for 1 Aug online publication on Commission to Investigate Allegations of Bribery and Corruption website; 90 legislators out of 225, however, failed to meet 31 July deadline. South East Asia",
        "severityScore": 10,
        "mediaScore": 93,
        "normalizedDifference": -0.8924731182795699
      },
      {
        "country": "Philippines",
        "description": "Bangsamoro peace process stayed on track despite occasional violence; govt forces continued to conduct anti-communist operations.",
        "detailedDescription": "Local insecurity persisted in Bangsamoro Autonomous Region in Muslim Mindanao (BARMM). Unidentified gunmen 2 Aug shot dead Roldan Benito, vice mayor of South Upi municipality in Maguindanao del Norte along with one of his security guards. Local media 6 Aug attributed incident to Benitos role as Teduray tribal leader in resisting unlawful appropriation of native land by armed non- Teduray persons; Bangsamoro govt same day condemned incident terming it a stark reminder of the challenges we face in our region. Unidentified gunmen 18 Aug ambushed and killed village chairman and his wife in Sultan Kudarat town, Maguindanao del Norte; investigators suspected murder due to Mustaphas involvement in anti-drug operation which disrupted local drug networks. Meanwhile, Supreme Court 20 Aug ordered election commission to stop plebiscite on BARMM which would have created two new municipalities in Maguindanao del Norte, and Nuling in Sultan Kudarat. Anti-New Peoples army operations continued. Soldiers 5-8 Aug clashed with communist rebels, resulting in ten New Peoples Army (NPA) militant fatalities. Two NPA rebels 22 Aug died in gun battle with army. Clashes in Municipality of Valderrama in Antique province 24 Aug killed NPA rebel. National Security Advisor 14 Aug said NPA forces continued to plummet in numbers with only five remaining guerrilla fronts saying that govt aimed to eliminate NPA completely by 2024. In another important development. Media outlet BBC 21 Aug reported ex-mayor of Bamban municipality fled Philippines after being accused of spying for China and having links with criminal groups.",
        "severityScore": 10,
        "mediaScore": 100,
        "normalizedDifference": -0.9
      }
    ],
    "Correlation": -0.5937532089184905
  },
  {
    "Region": "Europe and Central Asia",
    "Events": [
      {
        "country": "Georgia",
        "description": "Political parties intensified their election campaigns amid deepening polarisation, and breakaway Abkhazia region appointed veteran diplomat to serve as de facto foreign minister.",
        "detailedDescription": "Election campaigning accelerated amid deepening polarisation. Election campaigning in run-up to Oct parliamentary polls intensified. Ruling Georgian Dream party 13 Aug used anniversary of 2008 war with Russia to accuse largest opposition party and former administration United National Movement of starting war, backed by West, and promised to prosecute its leaders; opposition groups said comments escalated electoral tensions and further endangered Georgias path toward EU integration. Opposition parties and their allied media reported uptick in physical attacks and interference in their regional campaigns; notably, assailant 11 Aug punched leader of opposition alliance Coalition of Change, Nika Melia. Constitutional Court reviewed appeals against foreign agents law. Ministry of Justice 20 Aug appointed personnel responsible for implementing foreign influence law, which 1 Aug came into effect. Meanwhile, Constitutional Court 29-31 Aug held hearings on appeals against law filed by numerous civil society organisations and opposition MPs. Breakaway Abkhazia appointed veteran diplomat as de facto foreign minister. De facto president of breakaway Abkhazia 6 Aug appointed veteran diplomat Sergey Shamba as de facto FM. Shamba has held position twice before and previously called for increased dialogue with Tbilisi, raising hope among some that appointment could lead to more informal contacts. Meanwhile, Shamba 8 Aug announced Russia would not build naval base near Abkhazias Ochamchire town, a proposal floated by de facto president in 2023.  Russia (Internal) Ukraine launched incursion into Kursk region, capturing swath of Russian territory, killing dozens and forcing many thousands of civilians to evacuate; 26 people were freed in major Russia- West prisoner swap. Ukraine launched surprise offensive into Kursk region. Ukraine 6 Aug launched surprise cross-border ground assault, making rapid gains into poorly-defended areas of western Kursk region in largest incursion into Russia since World War II. Ukraines top general Oleksandr Syrskyi 27 Aug claimed forces had captured 1,294 sq km and 100 settlements, including Sudzha town, key Russian gas hub; they also destroyed three bridges over the Seym River and 15 Aug established military commandants office, indicating plans to try and hold on to territory. Russia 23 Aug accused Ukraine of attempts to attack Kursk nuclear power plant; head of UN nuclear watchdog Grossi 27 Aug warned about possibility of a nuclear accident after visiting site. According to Russian officials, well over 130,000 civilians had fled as of 31 Aug while incursion had left 31 dead, though actual toll could be much higher. Offensive began to slow late Aug as Russian units redeployed from other areas, though situation remained dynamic and heavy fighting continued, leaving open the possibility of further escalation along 1,200km-long frontline. Ukraine also attacked neighbouring Bryansk and Belgorod regions, though without much success. Meanwhile, Ukrainian attacks on infrastructure and military facilities escalated; notably, Ukrainian drones 28 Aug struck Kirov region for first time. Peace talks remained elusive. President Putin 12 Aug claimed Ukraine had launched Kursk offensive with the help of its Western masters in attempt to improve its negotiation position, and ruled out negotiations with people who indiscriminately attack civilians. According to 17 Aug report by media outlet The Washington Post, Kyiv and Moscow were planning talks in Qatar on cessation of strikes on energy infrastructure, which latter postponed following incursion. Russia completed largest prisoner exchange with West since Cold War. Russia, U.S. and other Western countries 1 Aug completed high-profile prisoner exchange involving 26 people, including U.S. journalist Evan Gershkovich, Russian opposition politicians and Russian intelligence officers (see Russia/U.S.).",
        "severityScore": 65,
        "mediaScore": 93,
        "normalizedDifference": -0.3010752688172043
      },
      {
        "country": "Azerbaijan",
        "description": "Baku and Yerevan overcame major stumbling block in peace talks, frontlines remained relatively calm despite occasional incidents, and relations with Iran remained fragile.",
        "detailedDescription": "Baku and Yerevan agreed to defer corridor issue amid ongoing peace efforts. Presidential aide Elchin Amirbayov 7 Aug told media outlet RFE/RL that Armenia and Azerbaijan had agreed to remove references to development of transport corridor linking Azerbaijan with its exclave Nakhchivan from draft peace treaty and to refer to it at a later stage; Yerevan next day confirmed announcement. Decision removed key sticking point in talks, and indicated sides could be opting for shorter, simplified statement, rather than the detailed agreement previously envisioned. Moscow appeared to insist on continued discussions about issue, however, given that the 2020 ceasefire deal potentially paved way for major Russian security role along corridor. Notably, Russian FM Sergei Lavrov 19 Aug urged sides to follow the spirit and letter of 2020 agreement, while President Aliyev and Russian President Putin 28 Aug reportedly exchanged views about opening of the transport corridor. Baku reported several small incidents along frontline. Baku 15, 16, 18 Aug accused Armenian forces of firing at military positions in traditionally calm areas of Nakhchivan, 19 Aug claimed its troops had come under fire along main road leading from Armenia to Kelbajar district; Baku same day said it had destroyed Armenian quadcopter in Lachin district. Yerevan denied all incidents and 15 Aug restated its June proposal to establish mechanism for investigating alleged ceasefire violations, which outgoing EU Special Representative Toivo Klaar 16 Aug reiterated support for. Important international developments. Baku 20 Aug applied for BRICS membership after Putins 18-19 Aug state visit. Meanwhile, Russian Security Council Secretary Sergei Shoigu 6 Aug met with Aliyev in capital Baku following trip to Iranian capital Tehran; visit came amid speculation that Iran  which accuses Baku of hosting Israeli military bases  could target Azerbaijan in retaliation for July assassination of Hamas political leader in Tehran, which it blamed on Israel; Russian media portrayed visits as effort to prevent all-out war in Middle East.",
        "severityScore": 35,
        "mediaScore": 77,
        "normalizedDifference": -0.5454545454545454
      },
      {
        "country": "Belarus",
        "description": "Minsk bolstered troop presence along border with Ukraine amid stepped-up tensions; West imposed more sanctions in response to crackdown.",
        "detailedDescription": "Tensions with Ukraine remained high. President Lukashenko 10 Aug claimed multiple Ukrainian drones had violated Belarusian airspace; Foreign Ministry same day summoned Ukrainian charg daffaires, threatening to review appropriateness of Kyivs diplomatic mission in Belarus in event of further such incidents. Lukashenko 18 Aug said he deployed nearly a third of Belarus armed forces to border with Ukraine in response to stepped-up troop presence there, also noting raised stakes due to Kyivs incursion into Russias Kursk region (see Russia). Kyiv 25 Aug urged Minsk to withdraw forces from border and warned officials to not make tragic mistakes [...] under Moscows pressure; days later, Lukashenko 29 Aug emphasised Belarusian troops will fight only when someone comes to us with bad intentions. Meanwhile, Lukashenko 15 Aug called on Russia and Ukraine to sit down at the negotiating table and end this scuffle, accusing the West of fuelling conflict. Western countries imposed additional sanctions against Belarus. U.S., Canada and UK 9 August announced sanctions against Belarus to mark fourth anniversary of disputed 2020 presidential election; in joint statement with EU, govts called on authorities to immediately and unconditionally release the almost 1,400 political prisoners. Later, Lukashenko 16 Aug signed decree pardoning 30 people convicted of protest-related crimes.",
        "severityScore": 30,
        "mediaScore": 95,
        "normalizedDifference": -0.6842105263157895
      },
      {
        "country": "Cyprus",
        "description": "Amid controversy over invitation to UN-mediated talks, Republic of Cyprus (RoC) faced criticism for alleged role in Gaza war and Turkish Republic of Northern Cyprus (TRNC) party leaders clashed.",
        "detailedDescription": "Confusion over invitation to UN-mediated talks sparked controversy. RoC President Christodoulides 3 Aug said he had accepted UN invitation to tripartite meeting on 13 Aug with TRNC leader Ersin Tatar. Tatar next day denied invitation, saying he would not have accepted it even if it was sent. RoC 5 Aug clarified govt had only been sounded out for possible meeting date. RoC accused of involvement in Gaza war. In response to RoC opposition Progressive Party of Working People (AKEL)s criticism of U.S. warship arriving in Limassol port, RoC 9 Aug said Cyprus is not involved in military operations or any conflict. Tatar 12 Aug accused RoC of becoming military stopover, being complicit in crimes against humanity in Gaza, making Cyprus into a target. TRNC party leaders clashed over approach to Cyprus problem. TRNC opposition party leader Tufan Erhrman 8 Aug criticised Tatars avoidance of diplomacy and dialogue. Tatar next day said, diplomacy has not stopped and accused Erhrman of adopting positions close to RoCs. In an important international development. Turkish FM Hakan Fidan 31 Aug attended informal EU Foreign Affairs Council meeting, first invitation to Turkish FM in five years, signalling positive turn in Trkiye-EU relations. Among other issues, long-stalled visa liberalisation and Customs Union upgrade processes were discussed; divergence persisted, however, over EUs linkage of Cyprus issue to Trkiye-EU relations. Notably, Fidan stated While we are committed to advancing our relations with the EU, it is not constructive to tie every aspect of our dialogue to the Cyprus issue.",
        "severityScore": 30,
        "mediaScore": 63,
        "normalizedDifference": -0.5238095238095238
      },
      {
        "country": "Armenia",
        "description": "Yerevan and Baku overcame major stumbling block in peace talks, while frontlines remained relatively calm despite occasional incidents.",
        "detailedDescription": "Yerevan and Baku agreed to defer corridor issue amid ongoing peace efforts. Azerbaijans presidential aide Elchin Amirbayov 7 Aug told media outlet RFE/RL that Armenia and Azerbaijan had agreed to remove references to development of transport corridor linking Azerbaijan with its exclave Nakhchivan from draft peace treaty and to refer to it at a later stage; Yerevan next day confirmed announcement. Decision removed key sticking point in talks, and indicated sides could be opting for shorter, simplified statement, rather than the detailed agreement previously envisioned. Moscow appeared to insist on continued discussions about issue, however, given that the 2020 ceasefire deal potentially paved way for major Russian security role along corridor. Notably, Russian FM Sergei Lavrov 19 Aug urged sides to follow the spirit and letter of 2020 agreement, while Azerbaijani President Aliyev and Russian President Putin 28 Aug reportedly exchanged views about opening of the transport corridor. Baku reported several small incidents along frontline. Baku 15, 16, 18 Aug accused Armenian forces of firing at military positions in traditionally calm areas of Nakhchivan, 19 Aug claimed its troops had come under fire along main road leading from Armenia to Azerbaijans Kelbajar district; Baku same day said it had destroyed Armenian quadcopter in Lachin district. Yerevan denied all incidents and 15 Aug restated its June proposal to establish mechanism for investigating alleged ceasefire violations, which outgoing EU Special Representative Toivo Klaar 16 Aug reiterated support for.",
        "severityScore": 15,
        "mediaScore": 80,
        "normalizedDifference": -0.8125
      },
      {
        "country": "Ukraine",
        "description": "Russian forces closed in on strategic town of Pokrovsk in Donetsk region, which looks set to become next epicentre of conflict in east; Kyivs forces launched surprise attack into Russias Kursk region.",
        "detailedDescription": "Russians closed in on Pokrovsk, key logistical hub in eastern Donetsk. Russian forces quickened their advance toward Donetsks Pokrovsk town, whose strategic location at intersection of several roads and railways facilitates provision of supplies to Ukrainian troops along eastern frontline. Authorities 15 Aug ordered civilians to evacuate as Russians closed in, making rapid gains late Aug in several areas south east of Pokrovsk and fuelling fears of grinding battle for control of town in coming weeks and months. Russian forces also continued their relentless advance near Toretsk and Chasiv Yar towns. Meanwhile, strikes on Ukrainian cities persisted, with President Zelenskyy 26 Aug calling early-morning Russian missile and drone attack one of the biggest combined strikes since full-scale invasion. Ukraine launched surprise incursion into Russian borderlands. Ukraine 6 Aug launched incursion into Russias Kursk region (see Russia), capturing swath of territory in attempt to strengthen Kyivs hand in future talks and divert Russian troops from Donetsk; top commander Gen. Syrskyi 27 Aug said Moscow had anticipated this and instead bolstered troops in Pokrovsk direction. In response to incursion, Russian President Putin 12 Aug ruled out talks with Kyiv; media outlet The Washington Post 17 Aug reported sides were planning talks in Qatar on mutual cessation of strikes on energy infrastructure. Zelenskyy 27 Aug said offensive was part of victory plan to end war. Kyiv sought support among African nations, engaged with Indian PM Modi. FM Kuleba 4-8 Aug visited Malawi, Zambia and Mauritius in effort to bolster support for Ukraine among African countries. Yet Mali 4 Aug cut ties with Ukraine over its alleged support for Tuareg-led deadly assault on Russian paramilitaries and Malian soldiers in July (see Mali); Niger 6 Aug followed suit. Meanwhile, Indian PM Modi 23 Aug held talks with Zelenskyy in capital Kyiv, called on warring parties to move toward diplomacy and said India is ready to play an active role in peace efforts. Western Europe/Mediterranean",
        "severityScore": 15,
        "mediaScore": 95,
        "normalizedDifference": -0.8421052631578947
      },
      {
        "country": "Kosovo",
        "description": "Govt efforts to fully integrate Serb-majority north continued, while President Osmani announced parliamentary elections would take place in February 2025.",
        "detailedDescription": "Pristina took further steps toward fully integrating Serb-majority north. PM Kurti 2 Aug presented govt plan to open central Ibar bridge, which connects Serb- dominated north and Albanian south of Mitrovica city, during briefing to representatives from Quint (U.S., UK, Germany, France, Italy) and EU ambassadors. Days later, hundreds of Kosovo Serbs 7 Aug gathered near bridge to protest plans, citing security concerns. U.S. Ambassador Jeff Hovenier 13 Aug warned move increases the threat [...] for the local community, but also for NATO soldiers. Police 5 Aug closed nine Serbian Post offices amid Pristinas efforts to push out Belgrade- backed institutions and end use of Serbian dinar for cash transactions; EU same day urged govt to reconsider its decision, calling for negotiated solution within EU- facilitated Dialogue. Govt 30 Aug announced closure of five illegal parallel institutions in north, prompting U.S. embassy same day to express disappointment with [govts] continuing uncoordinated actions and said issues related to Serbia- supported structures in Kosovo should be dealt with through the EU-facilitated Dialogue. In another important development. President Osmani 16 Aug announced parliamentary elections for 9 Feb 2025. Caucasus",
        "severityScore": 10,
        "mediaScore": 92,
        "normalizedDifference": -0.8913043478260869
      },
      {
        "country": "Russia",
        "description": "U.S. Russia completed largest prisoner exchange with West since Cold War.",
        "detailedDescription": "Russia, U.S. and other Western countries 1 Aug completed high-profile prisoner exchange involving 26 people, including U.S. journalist Evan Gershkovich, Russian opposition politicians and Russian intelligence officers. Exchange took place in Trkiye's capital Ankara with Turkish coordination. Eastern Europe",
        "severityScore": 0,
        "mediaScore": 100,
        "normalizedDifference": -1
      },
      {
        "country": "Kyrgyzstan",
        "description": "Sixth consultative meeting of Central Asian leaders underscored deepening regional cooperation.",
        "detailedDescription": "Kazakhstan 9 Aug hosted presidents from Kyrgyzstan, Tajikistan, Turkmenistan and Uzbekistan for VI Consultative Meeting of the Heads of State of Central Asia in capital Astana, also attended by Azerbaijani President Aliyev and head of UN Regional Centre for Preventive Diplomacy for Central Asia, Kaha Imnadze. Kazakh President Tokayev said these regular meetings illustrated all five countries commitment to strengthening cooperation, and hailed efforts to ensure regional stability and security, strengthen trade and expand transport links. Leaders signed number of documents, including several pertaining to development of regional integration in mid- and long-term.",
        "severityScore": 0,
        "mediaScore": 100,
        "normalizedDifference": -1
      },
      {
        "country": "Tajikistan",
        "description": "Sixth consultative meeting of Central Asian leaders underscored deepening regional cooperation; stifling of media persisted. Kazakhstan hosted sixth consultative meeting of Central Asian leaders.",
        "detailedDescription": "Kazakhstan 9 Aug hosted presidents from Kyrgyzstan, Tajikistan, Turkmenistan and Uzbekistan for VI Consultative Meeting of the Heads of State of Central Asia in capital Astana, also attended by Azerbaijani President Aliyev and head of UN Regional Center for Preventive Diplomacy for Central Asia, Kaha Imnadze. Kazakh President Tokayev said these regular meetings illustrated all five countries commitment to strengthening cooperation, and hailed efforts to ensure regional stability and security, strengthen trade and expand transport links. Leaders signed number of documents, including several pertaining to development of regional integration in mid- and long-term. Repression of media persisted. Committee to Protect Journalists 19 Aug urged authorities to release Ahmad Ibrohim, editor of independent weekly newspaper Payk, who was arrested 12 Aug; watchdog said Ibrohims arrest is a reminder of how dangerous any form of critical journalism is in the countrys deeply repressive media environment.",
        "severityScore": 0,
        "mediaScore": 100,
        "normalizedDifference": -1
      },
      {
        "country": "Uzbekistan",
        "description": "Sixth consultative meeting of Central Asian leaders underscored deepening regional cooperation, while PM Aripov visited Afghanistan . Kazakhstan hosted sixth consultative meeting of Central Asian leaders.",
        "detailedDescription": "Kazakhstan 9 Aug hosted presidents from Kyrgyzstan, Tajikistan, Turkmenistan and Uzbekistan for VI Consultative Meeting of the Heads of State of Central Asia in capital Astana, also attended by Azerbaijani President Aliyev and head of UN Regional Center for Preventive Diplomacy for Central Asia, Kaha Imnadze. Kazakh President Tokayev said these regular meetings illustrated all five countries commitment to strengthening cooperation, and hailed efforts to ensure regional stability and security, strengthen trade and expand transport links. Leaders signed number of documents, including several pertaining to development of regional integration in mid- and long-term. Ahead of meeting, Tokayev and President Mirzioyev 8 Aug held talks, with pair signing slew of documents aimed at boosting trade. PM Aripov visited Afghanistan. PM Aripov 17 Aug visited Afghan capital Kabul, marking first visit of PM from any country to Afghanistan since Taliban takeover; countries same day signed 35 trade and investment agreements worth $2.5bn.",
        "severityScore": 0,
        "mediaScore": 59,
        "normalizedDifference": -1
      }
    ],
    "Correlation": -0.10578067449629004
  },
  {
    "Region": "Latin America and the Caribbean",
    "Events": [
      {
        "country": "Ecuador",
        "description": "Violence persisted in strategic drug trafficking enclaves of Ecuador, while relations with Mexico remained strained.",
        "detailedDescription": "Ecuadors top court approved state of exception. Constitutional Court 1 Aug partially approved state of exception decree issued by President Noboa in early July on grounds of serious internal unrest rather than internal armed conflict. Noboa 8 Aug decreed new curfews in 19 cantons and one parish in Guayas, Los Ros, Orellana and Azuay provinces  which are all facing escalating violence  as supplement measure to state of exception. Noboa 30 Aug renewed state of exception for additional 30 days; curfew will also remain in place. Violence continued despite efforts to clamp down on criminal activities. Notably, Los Lobos and dissident faction Los Lobos Sao box 13 Aug clashed over control of mining area in Camilo Ponce Enriquez canton, Azuay province, killing five. Separately, five prisoners 5 Aug escaped from El Rodeo Prison in Portoviejo city, Manab province, despite militarisation of prisons. Meanwhile, Attorney Generals Office 19 Aug charged one lawyer and secretary of judicial unit in canton of Valencia, Los Ros province, for allegedly aiding three individuals from Albanian mafia. Frictions between Quito and Mexico City persisted. Mexico City 5 Aug urged Quito to grant safe passage to former VP Jorge Glas, whom authorities seized from Mexican embassy in April, requesting his transfer to third country from where he can travel to Mexico to seek asylum. Quito next day rejected request, reiterating that the granting of diplomatic asylum to Glas is illegal.  Venezuela Govt-controlled Supreme Court ratified President Maduros victory claim in July election, triggering further outcry from foreign govts as crackdown on opposition supporters deepened. Supreme Court validated Maduros re-election. Govt-controlled Supreme Court 22 Aug ratified President Maduros victory claim in July poll, which pitted him against opposition candidate, Edmundo Gonzlez, who also claimed victory. Court said ruling was supported by the tally reports issue by each of the vote machines, but did not share any tallies to substantiate claims; electoral authorities, meanwhile, had not provided breakdown of results by polling station by end of Aug despite both domestic and international calls to do so. International outcry over election continued. Foreign govts continued to express concern about poll, while UN Panel of Electoral Experts 9 Aug said lack of tabulated results had no precedent in contemporary democratic elections. Supreme Court ruling failed to convince most capitals that election results were credible. Notably, U.S. and ten Latin American states 23 Aug warned ruling lacks all credibility, given the overwhelming evidence that Gonzlez received the most votes, while Organization of American States same day said electoral authorities provided numbers that showed mathematical impossibilities. Brazil and Colombia sought negotiated solution to crisis, with Brazil even suggesting new elections, but there were no indications either Maduro or Gonzlez are willing to contemplate new poll. Govt repression persisted. Prosecutors office 30 Aug threatened Gonzlez with arrest warrant if he failed to appear for questioning about oppositions publication of electoral results, which it claimed proved Maduros defeat; despite warning, Gonzlez same day missed third and final summons. Meanwhile, domestic indignation at contested election continued. Maduro and other key govt figures 12 Aug dismissed opposition protests as conspiracy by fascist oligarchy backed by global right-wing forces. Crackdown on protests as of 31 Aug had resulted in 27 deaths and over 2,400 detentions, including some leading opposition figures snatched off the streets, in what Inter-American Human Rights Commission 28 Aug called a campaign of state terrorism; journalists, human rights activists and others continued to face repression. Govt 15 Aug approved anti-NGO law, which critics fear could force many organisations to shutter. Amazon",
        "severityScore": 95,
        "mediaScore": 100,
        "normalizedDifference": -0.05
      },
      {
        "country": "Mexico",
        "description": "Claudia Sheinbaum prepared to assume presidency in October as authorities pressed ahead with judicial reform, criminal violence persisted, and relations with U.S. remained strained.",
        "detailedDescription": "Sheinbaum prepared to assume office as Mexico pushed ahead with judicial reform. Federal Electoral Tribunal 14 Aug confirmed that Claudia Sheinbaum had received 59.7% of vote share in 2 June presidential election, validating her landslide victory and resolving challenges presented by opposition. Meanwhile, legislative commission for constitutional reform 26 Aug pre-approved judicial reform, likely to be passed in Sept when newly-elected Congress takes office; if approved, judges (including in Supreme Court) will be chosen by popular vote. Outgoing President Lpez Obrador 27 Aug paused govts relationship with U.S. and Canadian embassies after both ambassadors 22 Aug expressed concern about impact of reform on rule of law and economic ties. Criminal violence persisted, including in Guanajuato and Sinaloa states. Authorities 1 Aug found four men shot dead near Cancn city, Quintana Roo state, allegedly for providing protection to human smugglers, reflecting increased violence related to migration along Caribbean coast. Journalist Alejandro Martinez was shot dead 4 Aug in Celaya city, Guanajuato state; Guanajuato has highest number of homicides of any state in Mexico, with 18 police officers killed in Celaya in 2024, largely due to turf wars between rival gangs. Officials linked ten murders 16, 17 Aug in Sinaloa state to Sinaloa cartel infighting following late July arrest of groups leader, Ismael El Mayo Zambada, in U.S. state of Texas (see below). Drug lord arrest continued to spark controversy. Writing from U.S. prison, El Mayo 10 Aug claimed Guzmn Lpez, son of former Sinaloa Cartel leader El Chapo, lured him into meeting with Sinaloa state officials before Lpez kidnapped him and brought him to Texas. Mexican officials reiterated calls to U.S. to provide more information about arrest, while Lpez Obrador 6 Aug claimed Lpez organised arrest in pre-arranged deal with U.S. for leniency in his own criminal proceedings. Federal prosecutors 21 Aug announced charges against Lpez for kidnapping, issuing warrant for his arrest despite his custody in U.S., 29 Aug announced investigation into possible participation of Lpezs brother, alias El Ratn, in kidnapping.  Nicaragua Regime shuttered 1,500 NGOs, marking largest number of closures in single day since crackdown began in 2018; Managua severed ties with Braslia. Govt shuttered over 1,500 NGOs and intensified crackdown on Catholic Church. In record number of closures since 2018 anti-govt protests, govt 19 Aug shut down 1,500 NGOs in single day, many of them religious; authorities next day shuttered 151 more and 29 Aug closed another 169, bringing total number shut down since 2018 to well over 5,000; UN human rights agency 20 Aug called move deeply alarming, warning of severe impact of these measures on rights to freedom of association, expression [and] religion. Earlier, regime 12 Aug cancelled legal status of Diocesan Caritas Association of Matagalpa and 14 other NGOs in diocese; govt 17 Aug also introduced new operating requirements for civil society groups, requiring them to obtain state approval for projects in effort to increase govt oversight on civil society. Meanwhile, regime 1, 2 Aug arrested 11 priests and 8 Aug exiled seven of them to Rome, 10 and 11 Aug arrested two more priests before banishing them to Rome; moves come in context of systematic attacks against Catholic Church. Relations with Brazil deteriorated. Managua 8 Aug expelled Brazils ambassador to Nicaragua for refusing to participate in event celebrating 45th anniversary of Sandinista Revolution; Braslia same day retaliated in kind. Caribbean",
        "severityScore": 75,
        "mediaScore": 83,
        "normalizedDifference": -0.0963855421686747
      },
      {
        "country": "Colombia",
        "description": "Govt announced plans to open talks with two armed criminal groups, including Gaitanista Army (EGC), while ceasefire with ELN expired; clashes between rival EMC factions intensified.",
        "detailedDescription": "Govt and National Liberation Army (ELN) failed to extend ceasefire. Ceasefire between govt and ELN 3 Aug expired, with sides unable to reach agreement to extend terms. ELN continued to insist that talks, frozen since May, can only resume when govt meets list of demands, including removal of ELN from list of Organised Armed Groups; insurgency rejects designation, arguing it is a political organisation. Peace Commissioner Otty Patio 19 Aug said move would have legal consequences, while military warned it would limit their ability to use lethal force against group. ELN late Aug resumed combat against state, attacking police stations and blowing up oil pipelines in Arauca department. Meanwhile, ELN 12-19 Aug imposed armed strike in five southernmost municipalities of Choc department amid threat from Gaitanista Army of Colombia (EGC) (previously Gaitanista Self-Defence Forces of Colombia), with 50,000 people experiencing some form of confinement. ELN also faced pressure from EGC and EMC in Bolvar and Arauca departments. Govt announced new peace dialogues with two armed criminal groups. Govt 5 Aug made public July resolution opening dialogue with EGC, countrys largest armed criminal organisation, which could open opportunities to de-escalate regional conflicts between different armed groups. Govt 8 Aug published similar resolution dated one week earlier authorising talks with Conquistador Self Defence Forces of the Sierra Nevada (ACSN), regional outfit present along Atlantic coast. In contrast to negotiations with insurgencies that are legally considered to be political, like ELN, talks will focus on improving conditions in areas of armed group presence and working toward demobilisation. Clashes between EMC factions escalated. Clashes intensified between rival factions of FARC dissident group known as EMC, notably in Tolima and Huila departments, and between faction led by Ivn Mordisco and military following collapse of ceasefire in July. Mordisco 21 Aug also declared war in Amazon region on faction led by alias Calarc (which remains in talks with govt), raising risk of clashes there (see Amazon).",
        "severityScore": 50,
        "mediaScore": 29,
        "normalizedDifference": 0.42
      },
      {
        "country": "Haiti",
        "description": "Insecurity persisted despite deployment of police officers from Kenya-led security mission, which remained hamstrung by funding and equipment shortfalls; efforts to form electoral council stalled.",
        "detailedDescription": "Gang violence expanded beyond capital. Justice and Security Minister 12 Aug raised concerns about resurgence of gang violence in several parts of country, particularly noting attacks on Ganthier Customs Office and Monfort Institute for deaf children in Croix-des-Bouquets commune north east of capital Port-au-Prince. Confrontations between members of Viv Ansanm gang alliance and civilians in capitals Solino neighbourhood 15 Aug caused at least a dozen deaths and injuries on both sides. Prison break in Saint-Marc city 16 Aug resulted in 12 fatalities. Demonstrations 19 Aug broke out in Solino and other neighbourhoods of Port-au- Prince to demand support from police in defending their neighbourhoods. Meanwhile, U.S. 20 Aug sanctioned former president Michel Martelly for sponsoring gangs, facilitating drug trafficking and money laundering. Kenya-led foreign security mission faced challenges. Kenyan police officers from multinational security mission, tasked with battling gangs, carried out more joint patrols and targeted missions. Kenyan mission chief General Otunge 12 Aug told representative of Organization of American States that full operations against gangs were expected to begin in near future, without stating exact date. PM Conille 28 Aug announced joint operation between police and Kenyan officers to oust gangs from one of the roughest neighbourhoods of capital, but did not provide further details. Challenges with mission persisted, however, including limited resources, uncertain funding and need for reinforcements. U.S. and France 23 Aug delivered 26 armoured vehicles and equipment. Efforts to form electoral council stalled amid fragile political situation. PM Conille 7 Aug stressed in BBC interview that transitional govt is very fragile and in need of support from international community. He also warned it will be extremely difficult to hold elections before Feb 2026 without more security support and humanitarian aid. Meanwhile, Transitional Presidential Council struggled to form Provisional Electoral Council (CEP) to organise vote. Civil society groups, Catholic Church and press associations had agreed to nominate CEP representative but internal divisions led to pushback against selected individuals, stalling CEPs formation.",
        "severityScore": 40,
        "mediaScore": 97,
        "normalizedDifference": -0.5876288659793815
      },
      {
        "country": "El Salvador",
        "description": "Authorities renewed state of exception, while concerns grew over judicial independence.",
        "detailedDescription": "Authorities renewed state of exception. Legislative Assembly 8 Aug extended state of exception for another 30 days, which was first imposed in March 2022 amid high levels of gang violence, though in 29 Aug interview with Times magazine, President Bukele said govt hopes to lift measure in the near future. Though authorities have consistently pointed to measures role in reducing homicides, Attorney Generals 14 Aug report illustrated reported gender violence is growing, with 130 femicides and 8,984 cases of sexual violence documented between June 2023 and May 2024. Meanwhile, newspaper La Prensa Grfica 15 Aug reported govt had disbanded Specialised Unit for Cases of Disappeared Persons; enquiries will now be handled by new Sub-directorate Against Organised Crime. Human Rights Institute of the Central American University same day called move symbolic and objective dissolution that could hinder search for justice for families of missing persons. Appointment of new judges to Supreme Court risks impartiality of judiciary. President of Legislative Assembly Ernesto Castro 13 Aug announced that parliament, where President Bukeles party has majority, will appoint seven new magistrates to 15-member Supreme Court of Justice, despite constitutional provision that allows renewal of only one third of judiciary every three years.",
        "severityScore": 15,
        "mediaScore": 100,
        "normalizedDifference": -0.85
      }
    ],
    "Correlation": 0.015934257031806662
  },
  {
    "Region": "Middle East and North Africa",
    "Events": [
      {
        "country": "Egypt",
        "description": "Judicial reforms proposed amid economic challenges as Cairo continued to advocate for resolution to crises in Gaza, Red Sea and Sudan.",
        "detailedDescription": "Advisory body proposed judicial reforms amid economic crisis. National Dialogue Initiative 11 Aug suggested series of recommendations to President Sisi, which in- cluded justice system reforms that could reduce maximum pre-trial detention period and list of 600 detainees who could receive presidential pardon; Sisi 21 Aug ap- proved recommendations, which may garner him goodwill amid unpopular eco- nomic reforms and cost-of-living inflation. After PM Madbouly late July announced intention to remove all fuel subsidies by Dec 2025, govt continued to implement tough austerity measures including 1 Aug increasing metro ticket price in capital Cairo by 25-30%. Cairo continued push for ceasefire in Gaza (see Israel/Palestine). FM Abdelatty 5 Aug called on Washington to pressure Israel to stop its brinkmanship while Sisi 6, 16 and 23 Aug held calls with U.S. President Biden over intensifying efforts to reach ceasefire. Cairo, Doha, and Washington 9 Aug released joint statement advocating ceasefire, while Cairo 22-25 Aug hosted U.S., Israeli and Hamas negotiators in at- tempt to secure deal. Tensions with Israel over Philadelphi Corridor and Rafah bor- der crossing, however, persisted; state-affiliated media 5 Aug denied Israeli claims about existence in Philadelphi Corridor of operational tunnels leading into Gaza. Egypt remained opposed to Israels permanent presence in corridor as well as lack of Palestinian control of Rafah border. In other important international developments. Abdelatty 7 Aug met with chief of EU naval mission in Red Sea to discuss insecurity, which continued to limit Suez Canal revenues; Abdelatty praised mission but underlined Gaza conflict as root cause of deterioration. Meanwhile, govts attempt to host discussion between Sudanese pro-army delegation and U.S. officials over implementation of Jeddah agreement faltered after Khartoum attempted last minute changes to delegation.  Libya Relations between east- and west-based govts significantly deteriorated amid confrontations over legitimacy, central bank leader- ship and military manoeuvres, threatening to undermine fragile peace. Rival authorities attempted to delegitimise each other. Capital Tripoli-based govt 11 Aug expelled two Egyptian intelligence officers as reprisal for Cairos state visit invi- tation to non-internationally recognised east-based PM Hammad; in response, east- ern House of Representatives (HoR) Speaker Aguila Saleh 13 Aug announced Ham- mads administration as legitimate govt, withdrawing recognition of three-man Presidency Council in Tripoli that backs PM Dabaiba; move potentially pre-empted Presidency Council issuing possible decree freezing eastern parliament. Earlier, Khaled Mishri, who seeks agreement on new unified govt with HoR, 7 Aug installed himself as president of western-High State Council after claiming one more vote in internal election than outgoing president and Dabaiba-ally Mohamed Tekkala; Tek- kala contested result in court. Dangerous contest erupted over central bank leadership. Presidency Council 12 Aug issued decree dismissing central bank governor Siddiq Elkebir, called on Moham- med Shukri to take post and installed new board of directors. HoR 16 Aug, however, issued notice confirming Elkebir in post; Elkebir also refused to step down. Armed group in Tripoli 18 Aug kidnapped bank executive Musab Msallem and Elkebir sus- pended all Central Bank operations. Though Msallem released next day, operations remained suspended with banks closed across country. Hamads east-based govt 26 Aug ordered closure of oilfields controlled by eastern military commander Khalifa Haftar due to dispute; by 30 Aug daily oil barrel production dropped from 1.4mn to 590,000. Elkebir 30 Aug said he and other senior bank officials forced to flee country amid threat of militia violence. UN mission 26 Aug expressed concern over deteri- orating situation [...] resulting from unilateral decisions. East-based army movements unsettled Tripoli authorities. Media outlets early Aug reported Haftars Libyan National Army (LNA) intended to advance on Ghadames city bordering Algeria and Tunisia and under control of Tripoli-based forces. Tripoli authorities mobilised units to counter possible takeover, though LNA 14 Aug claimed it was only reinforcing positions across south. Meanwhile, clashes between armed groups in Tripoli 9 Aug killed nine, highlighting persistent insecurity.  Tunisia Political tensions worsened amid heightened repression and splits between President Saed and army ahead of October presiden- tial poll. Authorities imposed prison sentences on several presidential candidates. Judiciary sentenced several aspiring candidates to jail for alleged illegal campaign practices, including 5 Aug Nizar Chari and 14 Aug rapper alias K2Rym in absentia. Electoral body 10 Aug announced three candidates approved to run in 6 Oct vote, out of 108 who submitted nominations: incumbent Saed, little-known businessman Ayachi Zammel and Zouhair Maghzaoui of Arab nationalist Echaab movement, close to president, but critical of his poor economic record and closure of political space. Courts 27-30 Aug overturned electoral bodys rejection of candidacies of Abdellatif Makki, former leader of Islamist-inspired An-Nahda party, Mondher Zenaidi, min- ister under former President Ben Ali and Imed Dami, former leader of centre-left Congress for the Republic party; opposition could unite during volatile electoral pe- riod, raising stakes for vote. Meanwhile, alongside heightened political tensions, spectre of electoral violence rose; Saed 5 Aug called on citizens to fight forces op- posed to the Tunisian people, amid threats by presidents supporters to opposition candidates on social media. Strains emerged between Saed and army amid govt overhaul. Saed 7 Aug dis- missed PM Hanachi amid latters support to Agriculture Minister and army general Abelmonem Belatis plan to combat water stress. Water management  including supply limits  continued to be flashpoint between military establishment and Saed throughout month. President 25 Aug announced sudden govt reshuffle including re- moving Belati and shifting other military officials aside. Authorities arrested prominent human rights activist. In regimes continued at- tempts to neutralise those involved in post-2011 democratic transition, authorities 1 Aug issued arrest warrant for Sihem Bensedrine; Bensedrine, driving force behind transitional justice process, accused of falsifying report on crimes committed during Ben Alis dictatorship. UN 8 Aug said arrest cast chilling effect on journalists, hu- man rights defenders and civil society.",
        "severityScore": 65,
        "mediaScore": 100,
        "normalizedDifference": -0.35
      },
      {
        "country": "Iraq",
        "description": "Iran-backed militia rockets injured U.S. troops in attack on airbase, govt signed security agreement with Trkiye amid anti-Kurdi- stan Workers Party (PKK) operations and low-intensity Islamic State (ISIS) insurgency persisted.",
        "detailedDescription": "Iran-backed groups launched attack injuring U.S. troops, govt delayed decision on U.S. troop drawdown. Iran-backed militia 5 Aug struck Ain al-Asad base in Anbar governorate with two rockets, reportedly injuring 14, including at least five U.S. per- sonnel. Iraqi military next day condemned reckless attack; security officials 8 Aug said five people were arrested in connection with attack. Islamic Resistance in Iraq 18, 20 Aug claimed unconfirmed attacks on Israel. Foreign Ministry 15 Aug said that announcement of end date of U.S.-led coalitions mission in Iraq was postponed to early Sept due to latest developments, without identifying developments. Govt held security cooperation talks with Trkiye which continued striking PKK. Iraq and Trkiye 15 Aug held fourth High-Level Security Mechanism meeting in Turkish capital Ankara signed Memorandum of Understanding on military, security and counter-terrorism cooperation. Meanwhile, Ankara continued operations against PKK. Notably, Turkish defence ministry 7 Aug said PKK militants killed Turkish soldier in northern Iraq, 9 Aug said Trkiye neutralised 12 PKK militants, 12 Aug said Turkish airstrikes neutralised 17 PKK members in northern Iraq. Turk- ish drone 23 Aug killed two journalists in Kurdistan region. Supreme Judicial Coun- cil 1 Aug ruled to dissolve three Kurdish parties, Yazidi Freedom and Democracy Party, Democratic Struggle Front, and Party of Kurdistan Societys Freedom (Tavgari Azadi) for association with banned PKK. In other important developments. Nine months after provincial elections were held, disputed Kirkuk province 10 Aug elected Rebwar Taha of Patriotic Union of Kurdi- stan as new governor amid protests from Kurdistan Democratic Party and Iraqi Turkmen Front. Low-scale ISIS attacks continued; notably, in Kirkuk governorate, alleged ISIS attack 10 Aug reportedly killed one Hashd al-Shaabi member in Tuz Khurmatu district; airstrikes 29 Aug killed 14 alleged ISIS members. Iraqi and U.S. forces 29 Aug conducted joint operation against ISIS operatives in Western Anbar, which reportedly left 15 militants dead and seven U.S. soldiers injured.",
        "severityScore": 60,
        "mediaScore": 68,
        "normalizedDifference": -0.11764705882352941
      },
      {
        "country": "Syria",
        "description": "Iran-backed groups targeted U.S. base and clashed with SDF in east, armed groups fought in north and Israel launched several at- tacks.",
        "detailedDescription": "In east, Iran-backed militias and U.S. traded deadly attacks; Iran-backed militias clashed with SDF. Iran-backed groups 9 Aug launched drone attack at Kharab al-Jir base, Hasakah province, injured eight U.S. troops. Suspected U.S. drone 11 Aug killed eight Iran-backed militiamen near Iraqi border. Also in east, govt- and Iran-backed Arab tribal militias 6-7 Aug launched large-scale attack on Syrian Democratic Forces (SDF) positions in Deir ez-Zor province, killing at least three civilians. In response, SDF 7 Aug besieged govt-held areas in Hasakah and Qamishli towns, Hasakah prov- ince. Clashes between SDF and Arab tribal militias 7-12 Aug killed 38, including 19 civilians; notably, govt- and Iran-backed groups 9 Aug reportedly killed 12 civilians in Dahla village, Deir ez-Zor; SDF 12 Aug reportedly killed 17 Arab tribal militiamen. SDF 14 Aug lifted sieges but clashes next day resumed. In north, armed groups clashed. Clashes between SDF-aligned Afrin Liberation Forces, Trkiye-backed Syrian National Army (SNA) and Hayat Tahrir al-Sham (HTS) intensified. Notably, SNA-Afrin Liberation Forces clashes 11 Aug reportedly killed SNA member near Marea town, Aleppo province. In Idlib province, SNA-HTS clashes 12 Aug killed five. Afrin Liberation Forces 18 Aug reportedly killed HTS member near Afrin town, Aleppo. Clashes with SDFs Manbij Military Council 21 Aug killed two SNA militants in Manbij area, Aleppo. Meanwhile, bomb 9 Aug killed at least nine in Azaz city, Aleppo province. U.S. strike 23 Aug killed senior leader of Al- Qaeda-linked Horas al-Din group in Jabal al-Zawiya area, Idlib province. Israel reportedly launched several attacks. Alleged Israeli drone 3 Aug reportedly killed one on Damascus-Beirut road. Suspected Israeli airstrike 8 Aug targeted mis- sile warehouse near al-Shayrat airport, Homs province, injuring Iranian Islamic Rev- olutionary Guard Corps advisor who later died from wounds. Alleged Israeli airstrike 23 Aug killed three Iran-backed militants and injured ten in Homs and Hama prov- inces. Suspected Israeli drone strike 28 Aug killed three Palestinian fighters and one Hizbollah member on Damascus-Beirut highway. In other important developments. ISIS 17 Aug killed three govt forces near al-Habil oil field, Homs. Alleged Turkish drone 29 Aug killed one in Hasakahs Amuda town. Gulf and Arabian Peninsula",
        "severityScore": 45,
        "mediaScore": 98,
        "normalizedDifference": -0.5408163265306123
      },
      {
        "country": "Iran",
        "description": "Regional tensions soared after killing of senior Hamas official in capital Tehran while Gaza ceasefire talks intensified; parliament ap- proved president Pezeshkians unity cabinet.",
        "detailedDescription": "Regional tensions rose after senior Hamas official assassination in Tehran. U.S. significantly stepped up military deployments to defend against potential Iran/axis attack against Israel after late July killing widely attributed to Israel of senior Hamas official in capital Tehran. Against backdrop of intensified Gaza ceasefire talks, Is- lamic Revolutionary Guard Corps 20 Aug asserted Iran will not take hasty action in retaliation for July killing, saying Time is on our side and the waiting period for this response may be prolonged; U.S. officials 27 Aug continued to assess that Iran remained postured and poised [...] should they want to do that. U.S. forces came under fire from Iran-backed groups; notably suspected rocket attack on Ain al-Assad airbase in Iraq 5 Aug injured five U.S. personnel, drone attack on military base in north-eastern Syria 9 Aug injured further eight (see Iraq, Syria). Houthi launched attacks in Red Sea (see Yemen) and cross-border exchange between Hizbollah and Israel intensified (see Lebanon). U.S., Israel issued further sanctions on Iranian and Iran-backed entities. U.S. Treasury 15 Aug sanctioned companies, individuals and vessels for involvement in shipping Iranian goods to Yemen and United Arab Emirates on behalf of Houthi fi- nancial official; targeted Hong Kong-based company for its role in shipping Iranian LPG [Liquefied Petroleum Gas] worth tens of millions of dollars for [Hizbollah]. Israel 15 Aug sanctioned 18 vessels said to be transporting oil belonging to desig- nated terrorist organization Quds Force. Parliament approved president Pezeshkians proposed cabinet. Pezeshkian 11 Aug submitted 19 ministerial candidates. Parliament 21 Aug approved proposed cabinet, including reformists, marking first time in over two decades body accepted all pro- posed candidates. Notable figures include Abbas Araghchi, veteran of past nuclear negotiations, as foreign minister and Farzaneh Sadeq as minister of roads and trans- portation, becoming second female cabinet minister since 1979 establishment of Is- lamic Republic. U.S. accused Iran of election meddling. U.S. 19 Aug accused Iran of cyberattacks against presidential campaigns of Kamala Harris and Donald Trump to stoke dis- cord. Irans mission to UN 19 Aug called allegations entirely unfounded.",
        "severityScore": 40,
        "mediaScore": 82,
        "normalizedDifference": -0.5121951219512195
      },
      {
        "country": "Algeria",
        "description": "Domestic tensions rose ahead of 7 Sept presidential elec- tions; govt faced rocky relations with several international actors.",
        "detailedDescription": "Amid preparations for polls, former candidates faced criminal charges. With only three presidential candidates approved to run and main political groups including largest parties and unions supporting President Tebbounes re-election bid, incum- bent appeared set to win 7 Sept presidential election. Public prosecutors office 3-4 Aug detained 68 suspects on charges of fraud for allegedly having paid for backing for presidential candidatures; court 4 Aug placed three former candidates, Sada Naghza, Belkacem Sahli and Abdelhakim Hamadi, under judicial supervision over case. Authorities 27 Aug arrested opposition figure Fethi Ghares, reportedly on charges of insulting president and spreading false news, releasing him under judicial supervision two days later. Meanwhile, Tebboune 18 Aug hosted first election cam- paign rally in Constantine city, pledging support for Palestine in Gaza war, including in reconstruction. Security forces thwarted alleged separatist movement network. Govt 4 Aug ar- rested 21 individuals reportedly linked to Movement for the Self-determination of Kabylia, group authorities classified as terrorist organisation in 2021; Defence Min- istry said arrests were made in connection to alleged arms-smuggling plot through Bjaa port and attempt to disrupt upcoming election. Govt faced international tensions over regional issues. Algiers 11 Aug expressed concern over advance of troops commanded by eastern Libyan warlord Khalifa Haf- tar toward Libyan Ghadames border town, 6km from Algerian Deb-deb town (see Libya). Meanwhile, tensions also remained high with both France and Morocco over Paris July decision to support Moroccan autonomy plan for Western Sahara; nota- bly, Algerian and Moroccan representatives 23 Aug engaged in apparent scuffle at African development summit in Japans capital Tokyo over attendance of Sahrawi independence movement representative despite Moroccan protests. Govt also criti- cised activities of Russian paramilitaries in Mali close to Algerian border, with Alge- rian UN representative 26 Aug calling on UN Security Council to halt mercenary ac- tivities in area.",
        "severityScore": 30,
        "mediaScore": 100,
        "normalizedDifference": -0.7
      },
      {
        "country": "Yemen",
        "description": "Houthis continued attacks on international shipping, ap- pointed new govt and intensified crackdown on aid workers; tensions in Presidential Leadership Council (PLC) fuelled tensions in south.",
        "detailedDescription": "Houthis continued attacks in Red Sea and Gulf of Aden. Notably, Houthis 3 Aug struck container ship in Gulf of Aden; next day said they shot down U.S. spy drone. Four suspected Houthis attacks 8, 9 Aug targeted ship in Bab al-Mandeb strait; at- tack 21 Aug targeted Greek-flagged oil tanker in Red Sea, leaving it adrift and burn- ing, posing environmental hazard. U.S. forces continued strikes targeting Houthi in- frastructure, notably 9 Aug said they destroyed Houthi vessel, missile launcher and aerial vehicles. Houthis appointed new govt, consolidating power. Houthis 12 Aug announced new Change and Development Government 11 months after dismissing previous govt; appointment was delayed in Oct due to Houthis Red Sea operations and further groups efforts to consolidate power. Notably, 15 out of 21 ministers are from Hash- emite families closely aligned with groups leader Abdel Malik al-Houthi; represen- tation of General Peoples Congress party reduced to 15% from 50% in previous govt; in apparent effort to include southerners, Houthis appointed new PM Ahmed al- Rahwi from southern Abyan governorate. Houthis intensified arrests and harassment of aid workers. Houthi forces 3 Aug raided UN Human Rights Office in capital Sanaa and broadcast detainees forced confessions admitting to westernising Yemeni society; UN Human Rights Chief Volker Trk 13 Aug condemned raid and called for release of all UN staff detained in Yemen, including 13 staff taken in early June. In south, tensions driven by economic hardship and divisions in PLC escalated. Armed groups loyal to PLC member Abu Zaraa al-Muhrami 13 Aug raided PLC pres- idential office in Aden city after al-Muhrami accused office manager Yehiya al- Shuaibi of exploiting PLC allocations for personal financial gain. In Hadramawt gov- ernorate, dispute between Hadhrami tribal leaders and governor escalated with tribal armed groups 18 Aug cutting off oil supply from Masilah oil fields to local mar- kets, demanding share of revenue. Al-Qaeda in the Arabian Peninsula suicide attack 16 Aug killed 16 soldiers and injured 18 in Mudiyah district, Abyan province. North Africa",
        "severityScore": 25,
        "mediaScore": 86,
        "normalizedDifference": -0.7093023255813954
      },
      {
        "country": "Saudi Arabia",
        "description": "Authorities condemned Israel for assassination of Hamas leader Ismail Haniyeh and conducted diplomacy with Iran to pre- vent wider Middle East escalation.",
        "detailedDescription": "Riyadh appealed to Iran for limited retaliation against Israel. Following assassina- tion of Haniyeh late July in Iranian capital Tehran, FM Prince Faisal bin Farhan re- portedly engaged with Iranian officials pushing for de-escalation and limited retali- ation against Israel. During Organization of Islamic Cooperation meeting in Jeddah city, Deputy Minister of Foreign Affairs Walid al-Khuraiji 7 Aug condemned attack as blatant violation of Irans sovereignty and international law. In other important developments. U.S. State Dept 9 Aug announced lifting ban on offensive weapons sales to Saudi Arabia imposed in 2021 over kingdoms role in Yemen war. Saudi Arabia, U.S. and Switzerland 15-16 Aug co-hosted Sudan peace talks in Swiss city Geneva; talks included United Arab Emirates as observer state along with Egypt, AU and UN, but were boycotted by Sudanese Armed Forces (see Sudan).",
        "severityScore": 20,
        "mediaScore": 100,
        "normalizedDifference": -0.8
      },
      {
        "country": "Western Sahara",
        "description": "Sahrawi authorities criticised French support for Moroccan autonomy plan; more countries moved to open diplomatic of- fices in Moroccan-controlled territory.",
        "detailedDescription": "Fallout from Frances July switch to supporting Moroccan sovereignty over region continued. Pro-independence figures remained highly critical of Paris 3o July recog- nition of Rabats autonomy plan, which would give Morocco control over Western Saharas national security and foreign affairs; Abdelkader Taleb Omar  ambassador to Algeria for Polisario Fronts de facto state Sahrawi Arab Democratic Republic  5 Aug said Frances position has no legal impact and was built on falsehood; am- bassador also reaffirmed commitment to restore Sahrawi sovereignty over Moroc- can-occupied territories. Meanwhile, Sahrawi representative to AU Lamine Baali 23 Aug attended African development summit in Japans capital Tokyo despite Moroc- can protests, prompting apparent scuffle between Moroccan and Algerian represent- atives (see Algeria). Chad opened consulate to Morocco in Western Sahara, others to follow. In sign of support for Rabats sovereignty over disputed region, Chad 14 Aug opened consulate in Moroccan-controlled Dakhla city. Meanwhile, Dominican Republic 17 Aug an- nounced intention to also open consulate in Dakhla and reaffirmed support for Mo- roccan sovereignty.",
        "severityScore": 10,
        "mediaScore": 90,
        "normalizedDifference": -0.8888888888888888
      }
    ],
    "Correlation": -0.24343663707916632
  },
  {
    "Region": "North America",
    "Events": [
      {
        "country": "United States",
        "description": "(Internal) Democratic National Committee nominated VP Kamala Harris as its presidential candidate.",
        "detailedDescription": "As Nov U.S. presidential election drew closer, Democratic National Committee 5 Aug certified VP Harris as Democratic presidential nominee after virtual roll call in which she received 4,567 votes from delegates. Harris 6 Aug chose Minnesota governor and U.S. Army National Guard veteran Tim Walz as her running mate. At final day of 19- 22 Aug Democratic National Convention, Harris formally accepted nomination. Meanwhile, independent presidential candidate Robert F. Kennedy Jr. 23 Aug suspended his campaign and endorsed Republican candidate, former President Trump, saying he would remove his name from ballot in ten battleground states; several states denied his request.",
        "severityScore": 0,
        "mediaScore": 100,
        "normalizedDifference": -1
      }
    ],
    "Correlation": null
  }
]